{
  "data": [
    {
      "mal_id": 558073,
      "url": "https://myanimelist.net/reviews.php?id=558073",
      "type": "anime",
      "reactions": {
        "overall": 0,
        "nice": 0,
        "love_it": 0,
        "funny": 0,
        "confusing": 0,
        "informative": 0,
        "well_written": 0,
        "creative": 0
      },
      "date": "2025-04-08T22:29:00+00:00",
      "review": "Man. What an absolute blast. I understand the issues those who don’t like Solo Leveling have with the show. The plot so far has mainly been a vehicle instead of a driver so to speak. It simply does just enough to allow the strengths of the show to really shine through. There are really three reasons to watch this show that can sum up where my enjoyment lies. ANIMATION The animation of each fight in season 2 scaled from very good to amazing (except maybe the Baran fight. The grey cloak with the added rain did make it hard to see what was happening at somepoints and IMO was the least aesthetically pleasing fight).\n\nPOWER FANTASY\nSolo Leveling does a great job with one thing in this aspect: FUN. It is fun to watch Jinwoo exponentially grow stronger over the course of this season. He scales from a lower tier hunter to one of the best in the country and it is very satisfying to watch. No MC struggling or gaining power from anger or friendship, just the system helping him out!\n\n\nAnd lastly AURA FARMING\nYes, as goofy as it sounds, the memes are true. Jinwoo is the ultimate badass and commands attention in very impactful scenes in this season. He was the highlight of an entire episode that he was only in for 3 seconds! He is fun to pull for and it never gets old watching him show up and save the day. He’s the polar opposite of Saitama. We get to see how everyone else is amazed by Jinwoo’s capabilities and it’s so cool.\n\nI’d also like to add unlike isekai’s where the MC is teleported to another world and is super strong, Jineoo isn’t running around with 5 women at all times which is nice to see. There are women who admire him, but there are men in the show who admire him as well!\n\nIn my opinion, Solo Leveling isn’t some think piece anime in the likes of DevilMan Crybaby or Cyberpunk Edgerunners. It is pure fun. At the very least, you can turn your brain off and enjoy pulling for an MC that really takes on the role of the “I am strong and I know it” attitude.",
      "score": 9,
      "tags": ["Recommended"],
      "is_spoiler": false,
      "is_preliminary": false,
      "episodes_watched": null,
      "entry": {
        "mal_id": 58567,
        "url": "https://myanimelist.net/anime/58567/Ore_dake_Level_Up_na_Ken_Season_2__Arise_from_the_Shadow",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1448/147351.jpg?s=b03cdc1d00fe7b897df8f229789e0866",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1448/147351t.jpg?s=b03cdc1d00fe7b897df8f229789e0866",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1448/147351l.jpg?s=b03cdc1d00fe7b897df8f229789e0866"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1448/147351.webp?s=b03cdc1d00fe7b897df8f229789e0866",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1448/147351t.webp?s=b03cdc1d00fe7b897df8f229789e0866",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1448/147351l.webp?s=b03cdc1d00fe7b897df8f229789e0866"
          }
        },
        "title": "Ore dake Level Up na Ken Season 2: Arise from the Shadow"
      },
      "user": {
        "url": "https://myanimelist.net/profile/SxLxY",
        "username": "SxLxY",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/s/common/userimages/cb4ecf3e-e584-4434-84dc-e5b4e75e2421_225w?s=c06065e738bc26bb9d8ef0878f0855e9"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/s/common/userimages/cb4ecf3e-e584-4434-84dc-e5b4e75e2421_225w?s=c06065e738bc26bb9d8ef0878f0855e9"
          }
        }
      }
    },
    {
      "mal_id": 558068,
      "url": "https://myanimelist.net/reviews.php?id=558068",
      "type": "anime",
      "reactions": {
        "overall": 0,
        "nice": 0,
        "love_it": 0,
        "funny": 0,
        "confusing": 0,
        "informative": 0,
        "well_written": 0,
        "creative": 0
      },
      "date": "2025-04-08T19:25:00+00:00",
      "review": "“A haunting masterpiece that left me emotionally drained.” Grave of the Fireflies is one of the most emotionally devastating anime films I've ever seen. It’s not an easy watch, and honestly, it wasn’t meant to be. This is a powerful, tragic story about two siblings trying to survive in war-torn Japan, and the film pulls no punches in showing the harsh realities they face. I gave it an 8/10 because while it’s absolutely masterful in its storytelling and visual direction, it was incredibly difficult to get through. The sadness hits you hard and lingers long after the credits roll. Watching the bond between Seita and Setsuko slowlyunravel as hope fades was heartbreaking. The innocence of childhood being crushed under the weight of war—it’s just... heavy.\n\nThe animation is beautiful and subtle, which only adds to the impact. Every quiet moment feels meaningful, every firefly a symbol of fleeting life. I appreciate that it doesn’t rely on dramatics—it’s the simple, honest depiction of loss and love that makes it so devastating.\n\nIt’s not a film I’ll rewatch anytime soon, but I’m glad I experienced it. Grave of the Fireflies isn’t just an anime—it’s a deeply human story that forces you to sit with grief, and in that, it becomes unforgettable.",
      "score": 8,
      "tags": ["Recommended"],
      "is_spoiler": false,
      "is_preliminary": false,
      "episodes_watched": null,
      "entry": {
        "mal_id": 578,
        "url": "https://myanimelist.net/anime/578/Hotaru_no_Haka",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1485/141208.jpg?s=1bb1aa98ed81e093cf343019b207616d",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1485/141208t.jpg?s=1bb1aa98ed81e093cf343019b207616d",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1485/141208l.jpg?s=1bb1aa98ed81e093cf343019b207616d"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1485/141208.webp?s=1bb1aa98ed81e093cf343019b207616d",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1485/141208t.webp?s=1bb1aa98ed81e093cf343019b207616d",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1485/141208l.webp?s=1bb1aa98ed81e093cf343019b207616d"
          }
        },
        "title": "Hotaru no Haka"
      },
      "user": {
        "url": "https://myanimelist.net/profile/BerryBlitz",
        "username": "BerryBlitz",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/images/kaomoji_mal_white.png"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/images/kaomoji_mal_white.png"
          }
        }
      }
    },
    {
      "mal_id": 558066,
      "url": "https://myanimelist.net/reviews.php?id=558066",
      "type": "anime",
      "reactions": {
        "overall": 0,
        "nice": 0,
        "love_it": 0,
        "funny": 0,
        "confusing": 0,
        "informative": 0,
        "well_written": 0,
        "creative": 0
      },
      "date": "2025-04-08T19:14:00+00:00",
      "review": "After finishing Nihon e Youkoso Elf-san, I just sat there for a moment, staring at the screen, not fully ready to leave that world behind. This anime wasn’t just entertaining—it felt personal. I went into it expecting a typical fantasy setup, maybe a few laughs, some light action… but what I got was something way more meaningful. The story slowly wraps around you, not with epic battles or crazy twists, but with warmth, quiet emotions, and characters that genuinely feel alive. It’s one of those rare shows that doesn’t scream for your attention, but instead whispers gently and leaves a lasting impression. Let me start withKazuhiro – our MC. He’s not your usual overpowered, loud, “I’m gonna save the world!” type. He’s quiet, a little broken honestly, just trying to get by. His backstory really tugged at me… abandoned by his parents, finding some peace with his grandpa, and using sleep as a coping mechanism to escape reality. That hit close to home for me. There were nights in my own life when I just wanted to shut everything out and dream. I think a lot of us have been there at some point. And this anime somehow... understood that feeling.\n\nAnd then there’s Mariabelle. God. Where do I even begin? She’s the kind of character that doesn’t just walk into your screen – she walks into your heart. Beautiful, kind, a little naive in a good way, and so full of warmth. Her smile literally made me smile, and I don’t say that often. I could write paragraphs trying to describe her charm, but nothing I say will do her justice. You just have to see her.\n\nThere’s this one hilarious moment when she suddenly appears in Kazuhiro’s room and he’s freaking out, and I just burst out laughing. Like, full-on ugly laugh. The comedy in this anime is so natural – not forced or over-the-top – and I appreciate that.\n\nOh, and Wridra! The voice actress did such a fantastic job. She's got that dignified presence but then suddenly goes full puff-cheek mode when asking for something sweet. I rewound a few scenes just to hear that again. Adorable.\n\nThe whole cat-person Mewi being treated like a literal cat by Mariabelle? Too cute. Like, I almost teared up during one scene just because of how wholesome it was. This anime doesn’t rely on big fights or drama – it just gives you comfort. It’s like a warm cup of cocoa on a rainy day.\n\nWhat I really loved though… was the core concept. The idea that your dreams are actually real. That you’re living a whole other life in another world when you sleep. And that girl you meet there, the adventures you have… they all mean something. I’ve daydreamed about that exact thing since I was a kid. Watching this anime made it feel like someone out there got it – that maybe I wasn’t alone in wishing for that kind of escape.\n\nI swear, when episode 12 ended, I just sat there. Staring. Empty. That kind of post-anime void where you're just not ready to say goodbye. I actually whispered “That’s it?” out loud. I wish there was more. I need more.\n\nTo the creators – if by some miracle you ever read this: Thank you. Thank you for crafting something so heartfelt, something that feels like a gentle hug to the lonely parts of us. Please, please give us a Season 2. You’ve created a world we’re not ready to leave.",
      "score": 10,
      "tags": ["Recommended"],
      "is_spoiler": false,
      "is_preliminary": false,
      "episodes_watched": null,
      "entry": {
        "mal_id": 57648,
        "url": "https://myanimelist.net/anime/57648/Nihon_e_Youkoso_Elf-san",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1650/146113.jpg?s=eb438e00fc516e36c0dcd2de6f7ab756",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1650/146113t.jpg?s=eb438e00fc516e36c0dcd2de6f7ab756",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1650/146113l.jpg?s=eb438e00fc516e36c0dcd2de6f7ab756"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1650/146113.webp?s=eb438e00fc516e36c0dcd2de6f7ab756",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1650/146113t.webp?s=eb438e00fc516e36c0dcd2de6f7ab756",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1650/146113l.webp?s=eb438e00fc516e36c0dcd2de6f7ab756"
          }
        },
        "title": "Nihon e Youkoso Elf-san."
      },
      "user": {
        "url": "https://myanimelist.net/profile/AnimeExplorer21",
        "username": "AnimeExplorer21",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/s/common/userimages/853b5ea1-4a7c-4dfd-9e08-867fd0d23ad9_42x62_i?s=66d3915e8d1afb84d99b9282f486d8e2"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/s/common/userimages/853b5ea1-4a7c-4dfd-9e08-867fd0d23ad9_42x62_i?s=66d3915e8d1afb84d99b9282f486d8e2"
          }
        }
      }
    },
    {
      "mal_id": 558064,
      "url": "https://myanimelist.net/reviews.php?id=558064",
      "type": "anime",
      "reactions": {
        "overall": 0,
        "nice": 0,
        "love_it": 0,
        "funny": 0,
        "confusing": 0,
        "informative": 0,
        "well_written": 0,
        "creative": 0
      },
      "date": "2025-04-08T18:54:00+00:00",
      "review": "what a great anime with some great leads reminded me of heavenly delusion in that i loved Maru but in this momo what a great lead .. . the sheer randomness and absurdness of this anime is great it gets serious when it while not taking itself too serious great first season felt a bit like flcl .. . the random bickering and reaction are too good this had perfect pacing not slow not too fast on point with every character having great development .. even with less episodes ..would love to see what comes next... ..cute animation .. . great op eds with a great female lead binging gem ...cantwait for the next season...\nand the dub is even great and funnny..great s1 hope it stays like this..\nthis was all mad unpredictable and dark at times with some great characters can't to see more momo okurun action\n.\nthank you.\n. until next time.....dan da dannnnnnn...",
      "score": 8,
      "tags": ["Recommended"],
      "is_spoiler": false,
      "is_preliminary": false,
      "episodes_watched": null,
      "entry": {
        "mal_id": 57334,
        "url": "https://myanimelist.net/anime/57334/Dandadan",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1584/143719.jpg?s=1ee0178d04b975bbe011164b90ce2c85",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1584/143719t.jpg?s=1ee0178d04b975bbe011164b90ce2c85",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1584/143719l.jpg?s=1ee0178d04b975bbe011164b90ce2c85"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1584/143719.webp?s=1ee0178d04b975bbe011164b90ce2c85",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1584/143719t.webp?s=1ee0178d04b975bbe011164b90ce2c85",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1584/143719l.webp?s=1ee0178d04b975bbe011164b90ce2c85"
          }
        },
        "title": "Dandadan"
      },
      "user": {
        "url": "https://myanimelist.net/profile/Gintokiee",
        "username": "Gintokiee",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/s/common/userimages/ab59fb9b-df4c-447c-9e87-a3bd6f6eeb94_225w?s=2976b28f5afcaaae493ab45079691fb4"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/s/common/userimages/ab59fb9b-df4c-447c-9e87-a3bd6f6eeb94_225w?s=2976b28f5afcaaae493ab45079691fb4"
          }
        }
      }
    },
    {
      "mal_id": 558063,
      "url": "https://myanimelist.net/reviews.php?id=558063",
      "type": "anime",
      "reactions": {
        "overall": 0,
        "nice": 0,
        "love_it": 0,
        "funny": 0,
        "confusing": 0,
        "informative": 0,
        "well_written": 0,
        "creative": 0
      },
      "date": "2025-04-08T18:48:00+00:00",
      "review": "Princess Tutu is a 2002 anime starring (At the time) fairly new seiyuu, some who would eventually become fairly big in the industry. It existed in the context of the post-1997 anime industry which, due to the massive success of Evangelion, began to bet more into shorter (One to two cour) anime with more experimental stories while also embracing the innovations of digital animation - and in that regard, Princess Tutu's artstyle wouldn't feel out of place were it released five or even ten years later. This anime is WESTERN, but not western in the sense of \"Anime largely based on western cinema ans sensibilities\" asone would call anime made by Watanabe Shinichirou, nor western in the sense of \"A cowboy story\", but western in the sense that it not only is about the western cannon of theater, ballet, fairy tales and opera, is also structurally shapes itself around those aesthetically: The anime episodes not only represent an opera, THEY ARE, themselves, an opera.\nThat in itself makes it a bit hard to analyze it, as it is something that is best \"felt\", rather than \"described with words\".\n\nIt's arc structure is a bit unorthodox: It's first 13 episodes could themselves alone, with little to no changes, be a complete anime, and one that I would likely give a 10/10. It's second half isn't as strong or concise, but it still found interesting ways of expanding the story.\nThe anime is strongly episodic, with the episodes (Mainly in it's first half) having little to sometimes no epilogues to them (Sometimes the credits rolling right after the end of the climax), but it still manages to have some sense of progression via the relationships between the characters and the \"heart shard\" system, which brings visible change to our male lead, Mytho/Myuuto. The \"abandonment\" of such system in it's third quarter makes it a failure on trying to emulate it's first quarter, as some of it's episodes might now feel a bit repetitive and could easily have swapped places without anyone noticing, the stories themselves also feeling weaker, as they're not based on any specific emotion theme anymore, and it takes a while to get accustomed to that slower pacing after the aggressive spectacle of it's second quarter.\n\nIt had a fairly smart way of omitting and drip-feeding information, causing the audience to assume different things as different times (Such as the identity of the raven). Likewise, the decision to focus on different characters in different moments also leads to the relationships the anime will end up with to feel \"natural\" and \"fairly earned\".\nIt's somewhat funny that our \"secondary protagonists\", with time, end up becoming the focus: The character development of the mysterious Fakir, the tragedy of Rue, too weak to deal with sadness, falling to her darkest desires, feeling empowered by them... but alas, still being a human, we go back to seeing the fragility in her.\n\nBeing an anime of which one of the messages is using dance to convey that which cannot be conveyed with words, the series itself conveys with artistry in a way that can only be experiences, and not simply read in a review, it's a marriage between song, dance, theater and animation.",
      "score": 9,
      "tags": ["Recommended"],
      "is_spoiler": false,
      "is_preliminary": false,
      "episodes_watched": null,
      "entry": {
        "mal_id": 721,
        "url": "https://myanimelist.net/anime/721/Princess_Tutu",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1145/93646.jpg?s=6da6ac6089c4eac24f0b689353334019",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1145/93646t.jpg?s=6da6ac6089c4eac24f0b689353334019",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1145/93646l.jpg?s=6da6ac6089c4eac24f0b689353334019"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1145/93646.webp?s=6da6ac6089c4eac24f0b689353334019",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1145/93646t.webp?s=6da6ac6089c4eac24f0b689353334019",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1145/93646l.webp?s=6da6ac6089c4eac24f0b689353334019"
          }
        },
        "title": "Princess Tutu"
      },
      "user": {
        "url": "https://myanimelist.net/profile/thewiru",
        "username": "thewiru",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/s/common/userimages/72a8b3bd-505b-41bd-81c2-d8b7a72c1894_225w?s=85a3483019d3df78c665daa8ac1050d0"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/s/common/userimages/72a8b3bd-505b-41bd-81c2-d8b7a72c1894_225w?s=85a3483019d3df78c665daa8ac1050d0"
          }
        }
      }
    },
    {
      "mal_id": 558062,
      "url": "https://myanimelist.net/reviews.php?id=558062",
      "type": "anime",
      "reactions": {
        "overall": 0,
        "nice": 0,
        "love_it": 0,
        "funny": 0,
        "confusing": 0,
        "informative": 0,
        "well_written": 0,
        "creative": 0
      },
      "date": "2025-04-08T18:27:00+00:00",
      "review": "Yo, I’m not the best at writing reviews, so bear with me here. This hentai from Bunny Walker (or T-Rex, same vibes) is hands-down one of the best I’ve seen. Seriously, it’s a gem. Story: 10/10 The plot blew me away—probably the strongest I’ve ever seen in a hentai. It’s got that family dynamic with a mother and sister that just hits different. I’d kill for more stories like this. Art: 10/10 The artwork is straight-up gorgeous, and the animation quality is top-tier. None of that Queen Bee sketchiness here—it’s clean, crisp, and a total feast for the eyes. Animation: 10/10 What else do you expect from Bunny Walker or T-Rex? Theseguys are the kings of hentai animation. Smooth, polished, and just perfection.\nScenes: 10/10\nThe scenes were fire. I was hoping for a bit more focus on the mother with better angles, but honestly, everything else was so good I can’t complain. Still loved every second.\nCharacters: 10/10\nThe characters are what made this stand out. The milf mom and the sisters? Absolute MVPs. They’ve got charm, and I was hooked from start to finish.\nOverall: 10/10\nThis is peak hentai, no question. It’s pure vanilla goodness—zero NTR, no creepy ugly bastards, just wholesome romance with killer art and animation. I had a blast watching it, and you will too. Highly recommend giving it a shot!",
      "score": 10,
      "tags": ["Recommended"],
      "is_spoiler": false,
      "is_preliminary": false,
      "episodes_watched": null,
      "entry": {
        "mal_id": 39392,
        "url": "https://myanimelist.net/anime/39392/Master_Piece_The_Animation",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1195/101107.jpg?s=a75b4c0bb047b7a4231d25bdebf75e43",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1195/101107t.jpg?s=a75b4c0bb047b7a4231d25bdebf75e43",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1195/101107l.jpg?s=a75b4c0bb047b7a4231d25bdebf75e43"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1195/101107.webp?s=a75b4c0bb047b7a4231d25bdebf75e43",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1195/101107t.webp?s=a75b4c0bb047b7a4231d25bdebf75e43",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1195/101107l.webp?s=a75b4c0bb047b7a4231d25bdebf75e43"
          }
        },
        "title": "Master Piece The Animation"
      },
      "user": {
        "url": "https://myanimelist.net/profile/Zenith9907",
        "username": "Zenith9907",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/s/common/userimages/3290cb44-4546-4e06-869c-fdf91485f9ae_225w?s=c6e33991b0fb169242d8396008d99e11"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/s/common/userimages/3290cb44-4546-4e06-869c-fdf91485f9ae_225w?s=c6e33991b0fb169242d8396008d99e11"
          }
        }
      }
    },
    {
      "mal_id": 558060,
      "url": "https://myanimelist.net/reviews.php?id=558060",
      "type": "anime",
      "reactions": {
        "overall": 1,
        "nice": 0,
        "love_it": 0,
        "funny": 1,
        "confusing": 0,
        "informative": 0,
        "well_written": 0,
        "creative": 0
      },
      "date": "2025-04-08T18:11:00+00:00",
      "review": "Created/animated pretty much entirely by Shinkai. I see now that he is pretty much in charge of CoMix Wave Flims, the nepotistic self-fellation of him there makes now. Only 2 characters with no background or character traits of any kind beyond apparently having been classmates/friends with unvoiced crushes and 1 went off to be a space mecha pilot fighting aliens in space. These noncharacters fundamentally break the entire point of the movie centered around their star-crossed nonlove story of longing because it's all about their wanting to communicate over a long distance relationship despite the difficulty of time delay, yet NEITHER EVER ACTUALLY HAS ANYTHING TOSAY TO THE OTHER because these are noncharacters with nothing between them nor anything themselves to talk about. And it's not as if they couldn't just send messages pre-emptively most every day for each other rather than waiting around for a reply before sending a reply like idiots because again neither ever actually has anything to say.\nAnd I'm not even going to give consideration to the idiotic Ender's Game mecha-action joke of a background plot rammed in alongside this nonromance story.",
      "score": 1,
      "tags": ["Not Recommended"],
      "is_spoiler": false,
      "is_preliminary": false,
      "episodes_watched": null,
      "entry": {
        "mal_id": 256,
        "url": "https://myanimelist.net/anime/256/Hoshi_no_Koe",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1980/112997.jpg?s=c6377f1df5e76068e5e812966fb9d857",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1980/112997t.jpg?s=c6377f1df5e76068e5e812966fb9d857",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1980/112997l.jpg?s=c6377f1df5e76068e5e812966fb9d857"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1980/112997.webp?s=c6377f1df5e76068e5e812966fb9d857",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1980/112997t.webp?s=c6377f1df5e76068e5e812966fb9d857",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1980/112997l.webp?s=c6377f1df5e76068e5e812966fb9d857"
          }
        },
        "title": "Hoshi no Koe"
      },
      "user": {
        "url": "https://myanimelist.net/profile/1stDecame4Danime",
        "username": "1stDecame4Danime",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/images/kaomoji_mal_white.png"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/images/kaomoji_mal_white.png"
          }
        }
      }
    },
    {
      "mal_id": 558059,
      "url": "https://myanimelist.net/reviews.php?id=558059",
      "type": "anime",
      "reactions": {
        "overall": 0,
        "nice": 0,
        "love_it": 0,
        "funny": 0,
        "confusing": 0,
        "informative": 0,
        "well_written": 0,
        "creative": 0
      },
      "date": "2025-04-08T18:07:00+00:00",
      "review": "I'm not much of a writer and my english may be incorrect but bear with me please. This is one of the best hentai from bunny walker I have watched. Story is 9/10- this is hentai so the story is small but I love it, I need more vanilla type hentai like this. Art- 10/10, I have read its manga and the art is really good plus in animation as well. Not like queen bee Animation is 10/10, what can you expect from bunny walker or T-rex, they are literally the best hentai animators out there.Scenes - 10/10, I liked all\n\nCharacters- 10/10, I enjoyed this hentai more because of characters, love them all.\n\nOverall- 9.7/10.\n\nDefinitely recommend to all of you, there's no ntr, no ugly bastards, no forced but absolutely Vanilla, romance with great animation and art styles.\nI enjoyed it a lot now it's your time.\n\n\n\nLet me post it now, how much do I have to write.\n\nLeeeeeeeettttttttttttttttttttt'''''''''''''''''''sssssssssss, gooooooooooooooooo, leeeeeeeeeeeetttttttttt meeeeeeeeeeee pppppppppppuuuuuuuubbbbbbbbbbllllllliiiiiiiiisssssssssssssssssssssssssssshhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhh iiiiiiiiiiiittttttttttttttttttt.",
      "score": 10,
      "tags": ["Recommended"],
      "is_spoiler": false,
      "is_preliminary": false,
      "episodes_watched": null,
      "entry": {
        "mal_id": 48755,
        "url": "https://myanimelist.net/anime/48755/Imaizumin_Chi_wa_Douyara_Gal_no_Tamariba_ni_Natteru_Rashii",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1862/140626.jpg?s=57336a1c4ac8951255ca8ed43ac65cac",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1862/140626t.jpg?s=57336a1c4ac8951255ca8ed43ac65cac",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1862/140626l.jpg?s=57336a1c4ac8951255ca8ed43ac65cac"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1862/140626.webp?s=57336a1c4ac8951255ca8ed43ac65cac",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1862/140626t.webp?s=57336a1c4ac8951255ca8ed43ac65cac",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1862/140626l.webp?s=57336a1c4ac8951255ca8ed43ac65cac"
          }
        },
        "title": "Imaizumin Chi wa Douyara Gal no Tamariba ni Natteru Rashii"
      },
      "user": {
        "url": "https://myanimelist.net/profile/Zenith9907",
        "username": "Zenith9907",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/s/common/userimages/3290cb44-4546-4e06-869c-fdf91485f9ae_225w?s=c6e33991b0fb169242d8396008d99e11"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/s/common/userimages/3290cb44-4546-4e06-869c-fdf91485f9ae_225w?s=c6e33991b0fb169242d8396008d99e11"
          }
        }
      }
    },
    {
      "mal_id": 558058,
      "url": "https://myanimelist.net/reviews.php?id=558058",
      "type": "anime",
      "reactions": {
        "overall": 1,
        "nice": 0,
        "love_it": 0,
        "funny": 1,
        "confusing": 0,
        "informative": 0,
        "well_written": 0,
        "creative": 0
      },
      "date": "2025-04-08T18:07:00+00:00",
      "review": "It's a very shonen/action-focused anime. There really isn't much story nor anything meaningful explored beyond a series of mindless fights between various combinations of claymore warrior women and human-eating demon monsters. It never actually goes anywhere and just sort of reaches the end of the season still climbing that ladder as bait for the manga. The characters are barely allowed to have any presence beyond rehashing brain-damaging exposition/narration/peptalks and their 1-note character traits. The closest it comes to having actual characters in an arc gets unceremoniously cut through extreme contrivance. The plot armor is everywhere with pretty much every fight being nonsensical asspulls of more andmore powers being thrown in on top of the power of tryharding/friendship/love/etc to win from start to finish.\nTo be fair, as far as generic action-shonen go you could do much worse. At least this has some grittiness to it.",
      "score": 3,
      "tags": ["Not Recommended"],
      "is_spoiler": false,
      "is_preliminary": false,
      "episodes_watched": null,
      "entry": {
        "mal_id": 1818,
        "url": "https://myanimelist.net/anime/1818/Claymore",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/images/anime/3/21834.jpg?s=65000d7e3da24d3c6d0644d3ebaee79e",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/3/21834t.jpg?s=65000d7e3da24d3c6d0644d3ebaee79e",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/3/21834l.jpg?s=65000d7e3da24d3c6d0644d3ebaee79e"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/images/anime/3/21834.webp?s=65000d7e3da24d3c6d0644d3ebaee79e",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/3/21834t.webp?s=65000d7e3da24d3c6d0644d3ebaee79e",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/3/21834l.webp?s=65000d7e3da24d3c6d0644d3ebaee79e"
          }
        },
        "title": "Claymore"
      },
      "user": {
        "url": "https://myanimelist.net/profile/1stDecame4Danime",
        "username": "1stDecame4Danime",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/images/kaomoji_mal_white.png"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/images/kaomoji_mal_white.png"
          }
        }
      }
    },
    {
      "mal_id": 558057,
      "url": "https://myanimelist.net/reviews.php?id=558057",
      "type": "anime",
      "reactions": {
        "overall": 1,
        "nice": 0,
        "love_it": 0,
        "funny": 1,
        "confusing": 0,
        "informative": 0,
        "well_written": 0,
        "creative": 0
      },
      "date": "2025-04-08T18:06:00+00:00",
      "review": "Lots of parts are very reminiscent of Laputa Castle in the Sky but this is far worse, really wastes 2 hours of screen time on barely anything. It's more like Shuna's Journey or The Boy and the Heron or The Cat Returns, hell even like Paradise Island or Atlantis or any other of a million stories just like it that journey into the mcguffin fantasy land to do the mcguffin thing. The problem is this doesn't do anything with it. It's a generic journey through the Underworld to save the dead lover noncharacter, and even lampshades itself as such. I'm confused why they decided to dosuch a 1-note story stretched over so much nothing that it develops neither characters nor much of anything beyond a bunch of pointless wandering, exposition, and chases, while simultaneously having almost nothing to say about anything beyond \"nature is in fact what nature is.\"\n\nIt's not good. The scenes themselves are full of overexaggerated artificial feeling almost incessantly. The dub was poorly acted. The dialogue itself was terrible, mostly mindless exposition and self-narration and more grating artificiality.\nThe MC's motivations were nonsense, she constantly just follows everyone else around like a lost puppy before self-narrating that actually her character motivation is that she's lonely which is why she left her school friends and mother behind to go be alone listening to a radio in the mountains before following practical strangers into the Underworld to do whatever they want.\n\nThere are a lot of pointless side elements like the truth about the MC's father, or the fridge male who gets pointlessly replaced by his brother, or the background of a secret organization among other human organizations from history trying to pilfer the other world for knowledge (despite that they're simple medieval farmers and apparently none of the fantastical stuff had any effect on the world), or the gatekeepers (who are nothing more than plot devices and a hamfisted \"pollution is bad\" line), or the monster humanoids who can't eat the MC because endless plot armor... it's all pointless. None of it goes anywhere, none of it is meaningfully connected, it's just an uninspired series of events with decent animation quality much like the Earthsea anime movie. Even the radio voices referenced in the title in English have pretty much no relevance to the story itself, and the Japanese title means Children Who Chase Stars? There are 4 (really 3) children in this story and they mostly have barely any character nor importance to the plot and I could not for the life of me tell you why this movie is named the way it is in either language because their is only 1 child who barely happens to follow the voices mostly because an adult happened to lead her coincidentally that way and the voices turn out to be mostly irrelevant and dropped. And I guess because there are no stars in the magical Underworld it could be referencing the 1 child noncharacter fridge boy who wanted to see the outerworld where there are stars... which also has practically nothing to do with the movie.\n\n3/10 (where 5/10 is average)",
      "score": 3,
      "tags": ["Not Recommended"],
      "is_spoiler": false,
      "is_preliminary": false,
      "episodes_watched": null,
      "entry": {
        "mal_id": 9760,
        "url": "https://myanimelist.net/anime/9760/Hoshi_wo_Ou_Kodomo",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1000/133740.jpg?s=ff9d58335e8c3aff740430e57176c078",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1000/133740t.jpg?s=ff9d58335e8c3aff740430e57176c078",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1000/133740l.jpg?s=ff9d58335e8c3aff740430e57176c078"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1000/133740.webp?s=ff9d58335e8c3aff740430e57176c078",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1000/133740t.webp?s=ff9d58335e8c3aff740430e57176c078",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1000/133740l.webp?s=ff9d58335e8c3aff740430e57176c078"
          }
        },
        "title": "Hoshi wo Ou Kodomo"
      },
      "user": {
        "url": "https://myanimelist.net/profile/1stDecame4Danime",
        "username": "1stDecame4Danime",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/images/kaomoji_mal_white.png"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/images/kaomoji_mal_white.png"
          }
        }
      }
    },
    {
      "mal_id": 558056,
      "url": "https://myanimelist.net/reviews.php?id=558056",
      "type": "anime",
      "reactions": {
        "overall": 1,
        "nice": 0,
        "love_it": 0,
        "funny": 1,
        "confusing": 0,
        "informative": 0,
        "well_written": 0,
        "creative": 0
      },
      "date": "2025-04-08T18:06:00+00:00",
      "review": "Send this poor, mentally ill/schizophrenic child to a non-quack doctor. That was genuinely what I was thinking for much of the movie, all the more by the end of it. This movie barely goes anywhere and is almost completely SoL filler aside from a single exposition dump dialogue scene. The plot, beyond irrelevant specifics, is extremely predictable and boring, relying on unearned heartstring pulling. No justice for boat guy's irrelevance to the movie. No point to random fat-shamed character. No point to random exposition dump art-lady. The plot of this movie is summarized in one minute of exposition dialogue and spends the entire rest of themovie insincerely baiting a shallow romance while tipping its hand on a pointless mystery that is hard to care about as they present it in the most excessively saccharine way.",
      "score": 2,
      "tags": ["Not Recommended"],
      "is_spoiler": false,
      "is_preliminary": false,
      "episodes_watched": null,
      "entry": {
        "mal_id": 21557,
        "url": "https://myanimelist.net/anime/21557/Omoide_no_Marnie",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/images/anime/7/64293.jpg?s=40e7729bb55a7326dd0787ed47fffb2e",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/7/64293t.jpg?s=40e7729bb55a7326dd0787ed47fffb2e",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/7/64293l.jpg?s=40e7729bb55a7326dd0787ed47fffb2e"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/images/anime/7/64293.webp?s=40e7729bb55a7326dd0787ed47fffb2e",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/7/64293t.webp?s=40e7729bb55a7326dd0787ed47fffb2e",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/7/64293l.webp?s=40e7729bb55a7326dd0787ed47fffb2e"
          }
        },
        "title": "Omoide no Marnie"
      },
      "user": {
        "url": "https://myanimelist.net/profile/1stDecame4Danime",
        "username": "1stDecame4Danime",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/images/kaomoji_mal_white.png"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/images/kaomoji_mal_white.png"
          }
        }
      }
    },
    {
      "mal_id": 558055,
      "url": "https://myanimelist.net/reviews.php?id=558055",
      "type": "anime",
      "reactions": {
        "overall": 1,
        "nice": 0,
        "love_it": 0,
        "funny": 1,
        "confusing": 0,
        "informative": 0,
        "well_written": 0,
        "creative": 0
      },
      "date": "2025-04-08T18:05:00+00:00",
      "review": "A poorly written story of filler character drama to convey the very basic concept of escapism. Meanwhile, the memetic concept of Lil-Slugger and Maromi is maybe only in people's heads but also maybe real, while completely overlooking that the entire conflict of the entire story affecting the entirety of the city gets resolved immediately after fmc arbitrarily faces her trauma instead of resorting to escapism immediately after being confronted with it, and this one act immediately solves the entire memetic problem for everyone else, completely destroying the argument that it isn't a real entity. Pointless 2D character plotlines that go nowhere and haphazardly thrown in ideas andplot contrivances because it's just so cool that random old man is a plot contrivance doing math for no reason and random otaku exists and their dolls are maybe an autonomous ai program plot contrivance to have the police assistant to save the day and then become like the old man doing math for no reason and trust me the author says, this story is very deep because it pointlessly started with the empty ending scene of random escapism-inducing society stuff.",
      "score": 1,
      "tags": ["Not Recommended"],
      "is_spoiler": false,
      "is_preliminary": false,
      "episodes_watched": null,
      "entry": {
        "mal_id": 323,
        "url": "https://myanimelist.net/anime/323/Mousou_Dairinin",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/images/anime/7/10240.jpg?s=735a473c60023c894d8bc7e2cb6eaa3a",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/7/10240t.jpg?s=735a473c60023c894d8bc7e2cb6eaa3a",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/7/10240l.jpg?s=735a473c60023c894d8bc7e2cb6eaa3a"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/images/anime/7/10240.webp?s=735a473c60023c894d8bc7e2cb6eaa3a",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/7/10240t.webp?s=735a473c60023c894d8bc7e2cb6eaa3a",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/7/10240l.webp?s=735a473c60023c894d8bc7e2cb6eaa3a"
          }
        },
        "title": "Mousou Dairinin"
      },
      "user": {
        "url": "https://myanimelist.net/profile/1stDecame4Danime",
        "username": "1stDecame4Danime",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/images/kaomoji_mal_white.png"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/images/kaomoji_mal_white.png"
          }
        }
      }
    },
    {
      "mal_id": 558054,
      "url": "https://myanimelist.net/reviews.php?id=558054",
      "type": "anime",
      "reactions": {
        "overall": 4,
        "nice": 0,
        "love_it": 0,
        "funny": 1,
        "confusing": 3,
        "informative": 0,
        "well_written": 0,
        "creative": 0
      },
      "date": "2025-04-08T18:04:00+00:00",
      "review": "You have to look at older media through the lens of understanding that before modern internet there was a severe scarcity of porn such that any media depicting high-quality pornographic material wrapped within the veneer of a socially acceptable production would be regarded as a masterpiece. That is what has happened here with Soul(Ghost) in the Body(Shell) just like it did with A Clockwork Orange(A Machine in the Fruit, if you will). Getting to the actual review: How do we start? Director's masturbational intro cinematics of naked female body bodying (very important). Followed by long directorial vomit of self-indulgent concept art of the city in whichnothing happens. Oh-yeahh, waste my time harder, director daddy. Then they stumble through pointless stormtrooper action scenes and exposition dialogues of characters telling each other who they are and everything else they've already known about each other for the years they've worked together, interspersed by juvenile philosophical rambling that grapples with such worthwhile ideas as: 'How can one scientifically disprove that a machine isn't alive when one cannot scientifically define the arbitrary definitions of words?' and 'What is a person? I don't know.' By then over half the movie will be over and nothing of consequence will have happened. Then just finish it off with even more drawnout action sequence of stormtrooper bs and... I'm god of the machine now, k bye. The End.\n\nThis movie wasted so much potential of having such a well developed world from the manga, too bad the source material is episodic nonstories like this movie and the script writer is an amateur who couldn't cobble together much better.",
      "score": 3,
      "tags": ["Not Recommended"],
      "is_spoiler": false,
      "is_preliminary": false,
      "episodes_watched": null,
      "entry": {
        "mal_id": 43,
        "url": "https://myanimelist.net/anime/43/Koukaku_Kidoutai",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/images/anime/10/82594.jpg?s=bc7293f873246e6e6e4f6711e5e00416",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/10/82594t.jpg?s=bc7293f873246e6e6e4f6711e5e00416",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/10/82594l.jpg?s=bc7293f873246e6e6e4f6711e5e00416"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/images/anime/10/82594.webp?s=bc7293f873246e6e6e4f6711e5e00416",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/10/82594t.webp?s=bc7293f873246e6e6e4f6711e5e00416",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/10/82594l.webp?s=bc7293f873246e6e6e4f6711e5e00416"
          }
        },
        "title": "Koukaku Kidoutai"
      },
      "user": {
        "url": "https://myanimelist.net/profile/1stDecame4Danime",
        "username": "1stDecame4Danime",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/images/kaomoji_mal_white.png"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/images/kaomoji_mal_white.png"
          }
        }
      }
    },
    {
      "mal_id": 558053,
      "url": "https://myanimelist.net/reviews.php?id=558053",
      "type": "anime",
      "reactions": {
        "overall": 1,
        "nice": 0,
        "love_it": 0,
        "funny": 1,
        "confusing": 0,
        "informative": 0,
        "well_written": 0,
        "creative": 0
      },
      "date": "2025-04-08T18:04:00+00:00",
      "review": "It's fine, above average. It's a bit 1-note, hardly doing anything with such a fun premise. It didn't really have anything to say either so there isn't much to chew on for deeper meanings, it was merely spectacle done well on occasion (high budget cinematic art/animation and music). Which is fine, a story can be just a good spectacle to enjoy. But its main issue (aside from numerous dumb actions and contrivances throughout) was the large amount of mundane filler scenes (tons of pointless jobs) to pad the time in between anything of actual significance happening. Not intellectually stimulating, and not enough spectacle to be moresuperficially entertaining.\n\nSubplots like the person behind the gun or the guys sexploiting underaged girls never went anywhere (they even had the police ignore criminals shouting unprompted \"I didn't know they were underage, I swear!\" which is... a pattern all too common in Japanese media)... I was really excited when the main mentor guy showed up out of nowhere at the end and seemed like he was about to reveal himself to be a horrible person behind both... but no... just randomly there for no reason so those plot points were just convenient plot devices tossed aside.\n\nThere's an entire scene where we follow 2 characters who exist solely in this 1 scene, solely to discover 1 specific little ramification of FMC's powers which none of the actual characters in the story will ever learn about. Bizarrely out of place.\n\nThe backstory with sunshine girl's mother was never explored to give her any significance for us to care at all (she's just dying lady in bed with no lines or even actions) yet it was the impetus for the entire premise of her powers. (Also dumb that her main motivation was to enjoy her last moments with her mother, yet she wanders off potentially leaving her mother to die alone because she saw a bit of sunlight shine through the clouds.)\n\nThe ending (even ignoring the dumb time skip) was super half-assed from start to finish.\n\nThere was quite a bit of product placement, especially an out of place McD's scene which was borderline false advertising, in a competition to suck as many corporations off along with a message about how 'rising water levels/climate change caused by humanity is fine so just let nature run its course.'\nPlus the shameless, meaningless cameo of the MC of Your Name in a random family hiring the sunshine girl to try to ride the coat tails of its success.\n\nOverall it is broad strokes almost a beat for beat alternate version of Your Name by the same writer, just with a different fantasy power premise and much less effort in the story/characters. (this girl exists as pretty much just dreamboat love interest for the mc to romance/save, whereas in Your Name she actually had a character of her own and agency helping to save herself and everyone). At least this movie was a bit better/more coherent than Suzume by the same writer (also with many of the same broad strokes).",
      "score": 6,
      "tags": ["Mixed Feelings"],
      "is_spoiler": false,
      "is_preliminary": false,
      "episodes_watched": null,
      "entry": {
        "mal_id": 38826,
        "url": "https://myanimelist.net/anime/38826/Tenki_no_Ko",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1880/101146.jpg?s=b7de28a3543563db5da2fe1afec1a668",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1880/101146t.jpg?s=b7de28a3543563db5da2fe1afec1a668",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1880/101146l.jpg?s=b7de28a3543563db5da2fe1afec1a668"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1880/101146.webp?s=b7de28a3543563db5da2fe1afec1a668",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1880/101146t.webp?s=b7de28a3543563db5da2fe1afec1a668",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1880/101146l.webp?s=b7de28a3543563db5da2fe1afec1a668"
          }
        },
        "title": "Tenki no Ko"
      },
      "user": {
        "url": "https://myanimelist.net/profile/1stDecame4Danime",
        "username": "1stDecame4Danime",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/images/kaomoji_mal_white.png"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/images/kaomoji_mal_white.png"
          }
        }
      }
    },
    {
      "mal_id": 558052,
      "url": "https://myanimelist.net/reviews.php?id=558052",
      "type": "anime",
      "reactions": {
        "overall": 1,
        "nice": 0,
        "love_it": 0,
        "funny": 1,
        "confusing": 0,
        "informative": 0,
        "well_written": 0,
        "creative": 0
      },
      "date": "2025-04-08T18:03:00+00:00",
      "review": "Who is the audience for this? The BL is barely 2 goodbye pecks on the lips, and it's barely any romance overall with the leads being at best acquaintances who have almost no character consistency, wildly oscillating between: annoyance, abuser and enabler, friend, etc. on a dime, yet most of these characters who were actively going to slit others' throats will randomly become willing to give their lives to help them. All the characters are terrible, lacking in almost any personality beyond grumbling aside from the innocent goodboy non-character MC who may as well have been a golden retriever dog, at least then the timewasting filler dialoguewould've been avoided.\nThere's barely any sci-fi elements beyond random autonomous robot plot-contrivances used solely for chores and running messages rather than enforcing the 1984 surveillance government's control, and whatever sci-fi they attempt goes nowhere and instead becomes a nonsense plotline about some random fantasy nature deity who deus-ex-machinas the whole show in the end.\nThere's little action.\nThere's very little plot, outside the beginning and end the characters mostly just wander around doing filler like washing dogs, arguing about nothing, pulling up random plot threads that'll go nowhere... The actions of the cast didn't really have any relevance to the plot, the ending would've happened with or without them.\n\nThis show goes through so many of the same overall story beats as Fractale, except that anime did better in every way (though that is a low bar).",
      "score": 2,
      "tags": ["Not Recommended"],
      "is_spoiler": false,
      "is_preliminary": false,
      "episodes_watched": null,
      "entry": {
        "mal_id": 10161,
        "url": "https://myanimelist.net/anime/10161/No6",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1474/90768.jpg?s=f65aedc365b40deac5f42bc2f68a9e4b",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1474/90768t.jpg?s=f65aedc365b40deac5f42bc2f68a9e4b",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1474/90768l.jpg?s=f65aedc365b40deac5f42bc2f68a9e4b"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1474/90768.webp?s=f65aedc365b40deac5f42bc2f68a9e4b",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1474/90768t.webp?s=f65aedc365b40deac5f42bc2f68a9e4b",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1474/90768l.webp?s=f65aedc365b40deac5f42bc2f68a9e4b"
          }
        },
        "title": "No.6"
      },
      "user": {
        "url": "https://myanimelist.net/profile/1stDecame4Danime",
        "username": "1stDecame4Danime",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/images/kaomoji_mal_white.png"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/images/kaomoji_mal_white.png"
          }
        }
      }
    },
    {
      "mal_id": 558048,
      "url": "https://myanimelist.net/reviews.php?id=558048",
      "type": "anime",
      "reactions": {
        "overall": 0,
        "nice": 0,
        "love_it": 0,
        "funny": 0,
        "confusing": 0,
        "informative": 0,
        "well_written": 0,
        "creative": 0
      },
      "date": "2025-04-08T17:23:00+00:00",
      "review": "🌤The Sun Will Shine Again °7.4° °finishes strong with silver lining° 💯%🔍 👨‍👩‍👧‍👦Oota Kun must adjust to living with his brand new 👼🏻 sister, Mirai. Mirai gets all the attention🍼 so he battles with jealousy. He doesn't like Mirai... As his parents seem to only pay attention to him if he's in trouble, he's outside alone, and he finds some unexpected friends. These friends bring new insights into life, family, and what it all means. Here's a movie that I struggled to enjoy in the first half because I found all the characters unlikable. It wasn't until 2/3 of the film had passed that I could startto appreciate the ✨. The wrap up is lovely; by the time the credits rolled I was very pleased. This is a 🍭sweet film about a growing family.\n\nM is a 98 minute English dubbed 2018 release by Studio Chizu that is rated 7.28 on MAL. It is not entirely unlike the feel of a Studio Ghilbi production; it's just a touch... darker? More realistic? Without reading up on it at all, it's obvious that the show is based on real-life dynamics. While it looks backwards in time, it is without the nostalgia that makes for Ghilbi magic. The author clearly 📝 from personal experience. They have the busy couple nailed🔨.\n\nAs M opens we meet Oota Kun, who until this morning was the only🤴🏻child in the homestead, but now he is a big brother. He is 3 or 4 years old and loves 🚇🚂🚆. He can be a brat. Oota goes on to have some touching experiences that promote his growth. Sure, there's setbacks, as growth is not a Maglev bullet train. It's more like learning to drive a standard transmission: Rolling backwards happens almost as much as moving forward. We all roll backwards at times.\n\nMom, for example, is a b!+ch, at times. That's fair: She's postpartum, she's tired, and she's clearly got alot on her mind. Did I mention she's tired? This is all part of the family-of-stressors that factor in when we make families. Mom later questions how good of a job she's doing❔ and if she's truly balancing everything❓❓ We also get to see mom when she was young - she's had a lot of growing up to do herself! M &amp; D will talk later in the film about how she used to be angry all the time. They discuss how they've matured, and it's mostly because of the kids.\n\nIn typical opposites-attract contrast, dad is affable. Right now, mom just finds it /irritating/. Dad's easy-going nature also lends to letting others (mom) take the lead and handle the responsibilities. (Hence, mom is tired and stressed). The neighborhood women think dad is 😍 just /darling/. No doubt mom adored his laid-back nature when they were dating, but every good trait has its corresponding weakness. Women tend to l😑se their sense of humor in a marriage. There's plenty of good reasons for that, but still, it will hurt the woman and everyone around her. It's something to be mindful of. Even though I knew this, it still happened to me; I had to battle it. We'll learn what a caring person dad is. We also learn that dad's grandpa was H🔥T.\n\nThe primary theme is: Parents - it's going to get better. In addition to that, Oota has some huge 📶steps to climb when this movie opens: He's got big life changes going on. He comes to understand what family is and also manages to be brave and he learns. The first 👣 towards maturity is learning that we are not the center of the universe. Maturity is learning to be unselfish. Steps, consequently, are featured in about half of the frames, it seems. That can't be an accident.\n\nThe art🎨 is lovely. There's some train animation that is stunning. On a reality scale out of 10, people are drawn at about a 6.7 and backgrounds at around a 6 - simplified realism. It fits the theme perfectly.\n\nOne of the biggest benefits of M would be in preparing a younger child to share attention with a sibling. 🚧 Parents of preschoolers and primary aged kids &lt; 7, be aware: Ota has a nightmare where he calls to his mom's back and when she turns her head, it's a devil👺face. Other things might scare children, like when, in a dreamlike sequence, he gets lost at the train station. He may be forced to take the train to Lonely Land.\n\nOota loses his temper and hits his sister out of anger and jealousy. Some parents will see this as an opportunity for instruction, while others wouldn't want their children \"getting⚠ideas\". There's kids that are living in the same house with the same parents that would not benefit from the same choice between 'watch or don't watch'. So decide the best you can as to what age is appropriate to watch this.\n\n〰 IMHO📢\n\n📣6 📝7.7 🎭7.5 🌞5 🎨8.2 ⚡5.5 🎵/🔊6.5 😅3 😭2.5 😱3.5 😯5 😖0 🤔7 💤4 🔚10\n\nAge recommendation is child specific. One must watch the entire movie to reap the benefits of its positive message. I do not recall anything but G-rated language. Rated TV-PG: Parental Guidance\n\nRe-📺? I would because the first time around I spent the first half of the film not liking anyone. I would like to enjoy the whole show now.\n\nKidz\n4+ My Neighbor Totoro-8.2, Ponyo-9.1\n\n5+ Balto-8.3\n\n6+ D4DJ-7.5\n\n7+ Cardcaptor Sakura-7.4\nRatatouille-8.5\nMirai-7.4\n\n8+ Spirited Away-9\n\n9+Trollhunters-9.5 (slightly scary. Worst language is \"butt snack\")\n\n10+ C🇨🇳 Accidentally in Love-6.5 B-level scripting, acting, and directing, but still fun/strangely relaxing to watch,\nHoles-8,\nHowl's Moving Castle-8.9,\nK🇰🇷 A Love So Beautiful-7,\nMy Dog Skip-8,\nK🇰🇷 Part Time Idol-5.5 (suicide addressed),\nPaulie-7.4,\nSaiki-8,\nK🇰🇷Spark-6.4,\nK🇰🇷 Strongest Delivery Man-6.6\n\n11+ Belle-8.5,\nK🇰🇷 Flower Boy Next Door-7,\nGirls Und Panzer-8.1 (1 each d@mn, he!!),\nLabyrinth-7,\nC🇨🇳 A Little Thing Called First Love-8.5,\nLove Chunibyo And Other Delusions-8.4,\nK🇰🇷 The Miracle-7.7,\nOne Piece-7.5 there is scattered PG-13 language,\nWatership Down-8.5\n\n12+ K🇰🇷 99 Days With the Superstar-7,\nColourcloud Palace-8,\nFarming Life in Another World-7.7,\nGoonies l-8,\nHere Comes Miss Modern-7.8,\nHotel del Luna 8.4,\nJumanji-9,\nC🇨🇳 Love Between Fairy &amp; Devil-8.9,\nK🇰🇷 My ID is Gangnam Beauty-7.5 ,\nNiNoKuni-6.5\nPiano In The Forest l-8,\nK🇰🇷 So I Married My Anti-fan-6.8,\nYour Lie In April-9\n\n13+ K🇰🇷 Boys Over Flowers-8.3 ~ melodrama to the max;\nK🇰🇷Cinderella and the 4 Knights-5.6,\nK🇰🇷 Heirs-7.3,\nK🇰🇷 My Shy Boss-6.5,\nK🇰🇷 Playful kiss-7.3,\nPrincess Resurrection-7.6,\nSenryu Girl-7.5,\nSpecial A Class-8.2\n\n14+ My Runway-7.5\nPrincess Principal-8.6,\nToradora-8.5\n\nOriginally 〰️🖊 8/2023",
      "score": 7,
      "tags": ["Recommended"],
      "is_spoiler": false,
      "is_preliminary": false,
      "episodes_watched": null,
      "entry": {
        "mal_id": 36936,
        "url": "https://myanimelist.net/anime/36936/Mirai_no_Mirai",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1042/95674.jpg?s=a4909f23a543bedd5eef239bccb7d29e",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1042/95674t.jpg?s=a4909f23a543bedd5eef239bccb7d29e",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1042/95674l.jpg?s=a4909f23a543bedd5eef239bccb7d29e"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1042/95674.webp?s=a4909f23a543bedd5eef239bccb7d29e",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1042/95674t.webp?s=a4909f23a543bedd5eef239bccb7d29e",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1042/95674l.webp?s=a4909f23a543bedd5eef239bccb7d29e"
          }
        },
        "title": "Mirai no Mirai"
      },
      "user": {
        "url": "https://myanimelist.net/profile/50Fiftillididee",
        "username": "50Fiftillididee",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/images/kaomoji_mal_white.png"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/images/kaomoji_mal_white.png"
          }
        }
      }
    },
    {
      "mal_id": 558047,
      "url": "https://myanimelist.net/reviews.php?id=558047",
      "type": "anime",
      "reactions": {
        "overall": 0,
        "nice": 0,
        "love_it": 0,
        "funny": 0,
        "confusing": 0,
        "informative": 0,
        "well_written": 0,
        "creative": 0
      },
      "date": "2025-04-08T16:45:00+00:00",
      "review": "I had high expectations before watching the movie. That's why I expected something big but it wasn't very good except for the art design. The characters are very ordinary, the anime suddenly turned into a romantic comedy and then a drama, I was surprised at what I missed, I couldn't warm up to any of the characters. The story felt like it was written in 1 day, and the time skips suddenly happen and end suddenly, which is a very bad feeling in terms of watching pleasure. In short, it can be watched but there is not much going on except for the design, thecharacters are boring, the events happen and end suddenly.",
      "score": 7,
      "tags": ["Mixed Feelings"],
      "is_spoiler": false,
      "is_preliminary": false,
      "episodes_watched": null,
      "entry": {
        "mal_id": 41168,
        "url": "https://myanimelist.net/anime/41168/Nakitai_Watashi_wa_Neko_wo_Kaburu",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1045/106389.jpg?s=f41b733d8843a151434f15976b83c9f1",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1045/106389t.jpg?s=f41b733d8843a151434f15976b83c9f1",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1045/106389l.jpg?s=f41b733d8843a151434f15976b83c9f1"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1045/106389.webp?s=f41b733d8843a151434f15976b83c9f1",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1045/106389t.webp?s=f41b733d8843a151434f15976b83c9f1",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1045/106389l.webp?s=f41b733d8843a151434f15976b83c9f1"
          }
        },
        "title": "Nakitai Watashi wa Neko wo Kaburu"
      },
      "user": {
        "url": "https://myanimelist.net/profile/KiracTodd",
        "username": "KiracTodd",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/s/common/userimages/b7762b84-8c4d-4352-a3be-d80eeb3b39bc_225w?s=55efc024cb81d012af8daa2602904ba3"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/s/common/userimages/b7762b84-8c4d-4352-a3be-d80eeb3b39bc_225w?s=55efc024cb81d012af8daa2602904ba3"
          }
        }
      }
    },
    {
      "mal_id": 558045,
      "url": "https://myanimelist.net/reviews.php?id=558045",
      "type": "anime",
      "reactions": {
        "overall": 0,
        "nice": 0,
        "love_it": 0,
        "funny": 0,
        "confusing": 0,
        "informative": 0,
        "well_written": 0,
        "creative": 0
      },
      "date": "2025-04-08T16:07:00+00:00",
      "review": "Just started Salaryman ga Isekai ni Ittara Shitennou ni Natta Hanashi on Animyne, and this might be the most relatable isekai ever made—who knew demon armies ran on PowerPoint presentations and performance reviews?! Forget swords and magic; this protagonist conquers the fantasy world with staplers, flowcharts, and the power of middle-management hustle. Why It’s Brilliant: The premise alone deserves awards: a 30-something corporate drone gets reborn as one of the Demon King’s Four Heavenly Kings… only to realize demon generals spend 80% of their time arguing about supply chain logistics and troop morale budgets. Watching him \"overpower\" enemies by introducing efficient filing systems and team-building exercises iscomedy gold. The show’s genius is how it mirrors real-world office absurdity—when the protagonist defeats a rival faction by outsourcing their monster attacks to cheaper mercenaries, you’ll laugh, then cry because you’ve lived this.\n\nWho Should Watch?\n✔️ Burnt-out office workers who’ve dreamed of weaponizing their TPS reports\n✔️ Fans of The Devil is a Part-Timer! but with more red tape\n✔️ Anyone who wants an isekai where the final boss battle is a boardroom presentatio",
      "score": 7,
      "tags": ["Recommended"],
      "is_spoiler": false,
      "is_preliminary": false,
      "episodes_watched": null,
      "entry": {
        "mal_id": 59349,
        "url": "https://myanimelist.net/anime/59349/Salaryman_ga_Isekai_ni_Ittara_Shitennou_ni_Natta_Hanashi",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1668/144352.jpg?s=50df55d811480cf265d82b5a103e72c0",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1668/144352t.jpg?s=50df55d811480cf265d82b5a103e72c0",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1668/144352l.jpg?s=50df55d811480cf265d82b5a103e72c0"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1668/144352.webp?s=50df55d811480cf265d82b5a103e72c0",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1668/144352t.webp?s=50df55d811480cf265d82b5a103e72c0",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1668/144352l.webp?s=50df55d811480cf265d82b5a103e72c0"
          }
        },
        "title": "Salaryman ga Isekai ni Ittara Shitennou ni Natta Hanashi"
      },
      "user": {
        "url": "https://myanimelist.net/profile/bigbodybenz",
        "username": "bigbodybenz",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/s/common/userimages/a9be9511-e1f0-4829-969e-e764b8af6b43_42x62_i?s=5124226568ca93b606aee351974d8056"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/s/common/userimages/a9be9511-e1f0-4829-969e-e764b8af6b43_42x62_i?s=5124226568ca93b606aee351974d8056"
          }
        }
      }
    },
    {
      "mal_id": 558044,
      "url": "https://myanimelist.net/reviews.php?id=558044",
      "type": "anime",
      "reactions": {
        "overall": 0,
        "nice": 0,
        "love_it": 0,
        "funny": 0,
        "confusing": 0,
        "informative": 0,
        "well_written": 0,
        "creative": 0
      },
      "date": "2025-04-08T16:06:00+00:00",
      "review": "Currently watching Kono Kaisha ni Suki na Hito ga Imasu on Animyne, and it’s like sipping a warm, slightly bland cup of office coffee—comforting but forgettable. This workplace romance nails the \"will-they-won’t-they\" tension with competent (if predictable) execution, but it never quite boils over into something truly memorable. The Good: Misa and Souta’s dynamic is the show’s strongest asset. Their interactions—awkward elevator silences, stolen glances during meetings, and the \"oh god, was that flirting or just small talk?!\" panic—feel ripped from real-life office crushes. Misa’s confidence (she’s the one initiating most of their moments) is a welcome change from passive heroines, and Souta’s flustered reactions are adorable.The animation’s soft pastel aesthetic fits the low-key vibe, and the lack of over-the-top drama makes it a guilt-free binge.\n\nThe Bad:\nThe series leans too hard on safe tropes. Misunderstandings that could be solved with a single text message, filler side characters who exist solely to goad the leads, and a glacial pace that makes even hand-holding feel like a season finale. It’s so risk-averse that by Episode 8, you’ll be begging for anything to happen—a surprise ex, a workplace crisis, even a dramatic printer malfunction.",
      "score": 6,
      "tags": ["Mixed Feelings"],
      "is_spoiler": false,
      "is_preliminary": false,
      "episodes_watched": null,
      "entry": {
        "mal_id": 59361,
        "url": "https://myanimelist.net/anime/59361/Kono_Kaisha_ni_Suki_na_Hito_ga_Imasu",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1123/146384.jpg?s=92f1b5f84975535fd315a8298cb4658e",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1123/146384t.jpg?s=92f1b5f84975535fd315a8298cb4658e",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1123/146384l.jpg?s=92f1b5f84975535fd315a8298cb4658e"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1123/146384.webp?s=92f1b5f84975535fd315a8298cb4658e",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1123/146384t.webp?s=92f1b5f84975535fd315a8298cb4658e",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1123/146384l.webp?s=92f1b5f84975535fd315a8298cb4658e"
          }
        },
        "title": "Kono Kaisha ni Suki na Hito ga Imasu"
      },
      "user": {
        "url": "https://myanimelist.net/profile/bigbodybenz",
        "username": "bigbodybenz",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/s/common/userimages/a9be9511-e1f0-4829-969e-e764b8af6b43_42x62_i?s=5124226568ca93b606aee351974d8056"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/s/common/userimages/a9be9511-e1f0-4829-969e-e764b8af6b43_42x62_i?s=5124226568ca93b606aee351974d8056"
          }
        }
      }
    },
    {
      "mal_id": 558043,
      "url": "https://myanimelist.net/reviews.php?id=558043",
      "type": "anime",
      "reactions": {
        "overall": 0,
        "nice": 0,
        "love_it": 0,
        "funny": 0,
        "confusing": 0,
        "informative": 0,
        "well_written": 0,
        "creative": 0
      },
      "date": "2025-04-08T16:06:00+00:00",
      "review": "Brace yourself for peak absurdity—100 Girlfriends Season 2 on Animyne is here to break the rom-com genre over its knee and deliver the most gloriously unhinged harem chaos imaginable! If you thought the first season was wild, this sequel cranks the madness to \"how is this even legal?\" levels while somehow being the purest love story ever told. Rentarou’s harem keeps growing (how does he even remember all their names?!), and each new girlfriend is a masterclass in comedic character design—from the yandere who literally breathes fire when jealous to the girlfriend who communicates solely through interpretive dance. The show’s secret weapon? It knows how ridiculousit is and leans in harder than a Jenga tower on a trampoline. Fourth-wall breaks? Check. Parodying every rom-com trope in existence? Double-check. A musical number about the existential dread of sharing your soulmate with 99 others? Somehow, yes.\n\nYet beneath the insanity, there’s genuine heart—Rentarou’s devotion to making each girlfriend feel uniquely loved is almost too wholesome for a series featuring a girl who falls in love via sneeze-induced nosebleeds. The animation team clearly had unlimited fun, with visual gags flying faster than a tsundere’s fist, and the voice cast’s commitment to the bit is Oscar-worthy.",
      "score": 9,
      "tags": ["Recommended"],
      "is_spoiler": false,
      "is_preliminary": false,
      "episodes_watched": null,
      "entry": {
        "mal_id": 57616,
        "url": "https://myanimelist.net/anime/57616/Kimi_no_Koto_ga_Daidaidaidaidaisuki_na_100-nin_no_Kanojo_2nd_Season",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1093/145470.jpg?s=e860bb48cd0f561ced13875723a0c16c",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1093/145470t.jpg?s=e860bb48cd0f561ced13875723a0c16c",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1093/145470l.jpg?s=e860bb48cd0f561ced13875723a0c16c"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1093/145470.webp?s=e860bb48cd0f561ced13875723a0c16c",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1093/145470t.webp?s=e860bb48cd0f561ced13875723a0c16c",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1093/145470l.webp?s=e860bb48cd0f561ced13875723a0c16c"
          }
        },
        "title": "Kimi no Koto ga Daidaidaidaidaisuki na 100-nin no Kanojo 2nd Season"
      },
      "user": {
        "url": "https://myanimelist.net/profile/bigbodybenz",
        "username": "bigbodybenz",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/s/common/userimages/a9be9511-e1f0-4829-969e-e764b8af6b43_42x62_i?s=5124226568ca93b606aee351974d8056"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/s/common/userimages/a9be9511-e1f0-4829-969e-e764b8af6b43_42x62_i?s=5124226568ca93b606aee351974d8056"
          }
        }
      }
    },
    {
      "mal_id": 558041,
      "url": "https://myanimelist.net/reviews.php?id=558041",
      "type": "anime",
      "reactions": {
        "overall": 0,
        "nice": 0,
        "love_it": 0,
        "funny": 0,
        "confusing": 0,
        "informative": 0,
        "well_written": 0,
        "creative": 0
      },
      "date": "2025-04-08T16:04:00+00:00",
      "review": "Just finished Botsuraku Yotei no Kizoku dakedo, Hima Datta kara Mahou wo Kiwametemita on Animyne, and this might be the most unexpectedly charming magic academy anime I've seen in ages! While the title is a mouthful (seriously, it needs an abbreviation), the series itself is a delightful mix of self-awareness, wit, and surprisingly solid world-building. Roland is an instant favorite protagonist—instead of freaking out about his \"doomed noble\" fate in an otome game world, he treats it like a minor inconvenience and dives headfirst into magical research. His deadpan reactions to dramatic story beats and his sheer enthusiasm for spellcraft make him endlessly entertaining. The magicsystem itself is a highlight, emphasizing creative problem-solving over flashy power levels—watching Roland geek out over magical theory or accidentally revolutionize spells through sheer curiosity is oddly satisfying.\n\nThe supporting cast plays off him perfectly, especially the original game's \"heroine\" who keeps getting thrown off by Roland's complete disinterest in following the script. The humor lands consistently, balancing meta jokes about otome tropes with genuine character moments that make you root for this chaotic noble.",
      "score": 7,
      "tags": ["Mixed Feelings"],
      "is_spoiler": false,
      "is_preliminary": false,
      "episodes_watched": null,
      "entry": {
        "mal_id": 58437,
        "url": "https://myanimelist.net/anime/58437/Botsuraku_Yotei_no_Kizoku_dakedo_Hima_Datta_kara_Mahou_wo_Kiwametemita",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1245/147612.jpg?s=4031a6f035a3bcb3311d4df77cea222f",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1245/147612t.jpg?s=4031a6f035a3bcb3311d4df77cea222f",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1245/147612l.jpg?s=4031a6f035a3bcb3311d4df77cea222f"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1245/147612.webp?s=4031a6f035a3bcb3311d4df77cea222f",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1245/147612t.webp?s=4031a6f035a3bcb3311d4df77cea222f",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1245/147612l.webp?s=4031a6f035a3bcb3311d4df77cea222f"
          }
        },
        "title": "Botsuraku Yotei no Kizoku dakedo, Hima Datta kara Mahou wo Kiwametemita"
      },
      "user": {
        "url": "https://myanimelist.net/profile/bigbodybenz",
        "username": "bigbodybenz",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/s/common/userimages/a9be9511-e1f0-4829-969e-e764b8af6b43_42x62_i?s=5124226568ca93b606aee351974d8056"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/s/common/userimages/a9be9511-e1f0-4829-969e-e764b8af6b43_42x62_i?s=5124226568ca93b606aee351974d8056"
          }
        }
      }
    },
    {
      "mal_id": 558039,
      "url": "https://myanimelist.net/reviews.php?id=558039",
      "type": "anime",
      "reactions": {
        "overall": 0,
        "nice": 0,
        "love_it": 0,
        "funny": 0,
        "confusing": 0,
        "informative": 0,
        "well_written": 0,
        "creative": 0
      },
      "date": "2025-04-08T16:03:00+00:00",
      "review": "Just finished Izure Saikyou no Renkinjutsushi? on Animyne, and this might be the most underrated isekai of the season! While it follows the familiar \"transported to another world\" setup, it flips the script by making its protagonist’s strength lie not in brute force, but in creativity, intellect, and sheer passion for alchemy. Lucien is a breath of fresh air as an MC—he’s not the typical overpowered hero who steamrolls every obstacle. Instead, his journey is about problem-solving and innovation, treating alchemy like a dynamic science rather than a magic cheat code. Watching him geek out over new ingredients, test theories, and refine his craft is oddlythrilling—it turns potion-making into its own kind of action sequence.\n\nThe world-building is delightfully detailed, with a magic system that feels grounded in logic (for a fantasy setting, at least). The show takes time to explore how Lucien’s \"mediocre\" techniques from his old world become revolutionary in this one, sparking both admiration and conflict. The supporting cast, from skeptical guildmates to rival alchemists, adds layers of intrigue without falling into tired tropes.",
      "score": 8,
      "tags": ["Mixed Feelings"],
      "is_spoiler": false,
      "is_preliminary": false,
      "episodes_watched": null,
      "entry": {
        "mal_id": 58822,
        "url": "https://myanimelist.net/anime/58822/Izure_Saikyou_no_Renkinjutsushi",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1431/146222.jpg?s=6e074a95f94a0aa8cdfac1b21205f71f",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1431/146222t.jpg?s=6e074a95f94a0aa8cdfac1b21205f71f",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1431/146222l.jpg?s=6e074a95f94a0aa8cdfac1b21205f71f"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1431/146222.webp?s=6e074a95f94a0aa8cdfac1b21205f71f",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1431/146222t.webp?s=6e074a95f94a0aa8cdfac1b21205f71f",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1431/146222l.webp?s=6e074a95f94a0aa8cdfac1b21205f71f"
          }
        },
        "title": "Izure Saikyou no Renkinjutsushi?"
      },
      "user": {
        "url": "https://myanimelist.net/profile/bigbodybenz",
        "username": "bigbodybenz",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/s/common/userimages/a9be9511-e1f0-4829-969e-e764b8af6b43_42x62_i?s=5124226568ca93b606aee351974d8056"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/s/common/userimages/a9be9511-e1f0-4829-969e-e764b8af6b43_42x62_i?s=5124226568ca93b606aee351974d8056"
          }
        }
      }
    },
    {
      "mal_id": 558038,
      "url": "https://myanimelist.net/reviews.php?id=558038",
      "type": "anime",
      "reactions": {
        "overall": 0,
        "nice": 0,
        "love_it": 0,
        "funny": 0,
        "confusing": 0,
        "informative": 0,
        "well_written": 0,
        "creative": 0
      },
      "date": "2025-04-08T16:02:00+00:00",
      "review": "Currently watching Zenshuu on Animyne, and while it’s undoubtedly one of the most visually striking anime I’ve seen this season, I can’t help but feel it’s a missed opportunity. The premise—exploring meditation and spirituality through the lives of monks at a secluded temple—is brimming with potential, but the execution leaves me conflicted. When Zenshuu leans into its meditative core, it’s breathtaking. The animation transforms during these sequences, using surreal, dreamlike visuals to depict inner peace and psychological turmoil. Scenes of characters confronting their pasts or sinking into deep contemplation are poetic and powerful, elevated by a hauntingly beautiful soundtrack that perfectly complements the tone.",
      "score": 7,
      "tags": ["Mixed Feelings"],
      "is_spoiler": false,
      "is_preliminary": false,
      "episodes_watched": null,
      "entry": {
        "mal_id": 58502,
        "url": "https://myanimelist.net/anime/58502/Zenshuu",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1003/146841.jpg?s=26ca92442090d2a104fb4b0bf44c0a86",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1003/146841t.jpg?s=26ca92442090d2a104fb4b0bf44c0a86",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1003/146841l.jpg?s=26ca92442090d2a104fb4b0bf44c0a86"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1003/146841.webp?s=26ca92442090d2a104fb4b0bf44c0a86",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1003/146841t.webp?s=26ca92442090d2a104fb4b0bf44c0a86",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1003/146841l.webp?s=26ca92442090d2a104fb4b0bf44c0a86"
          }
        },
        "title": "Zenshuu."
      },
      "user": {
        "url": "https://myanimelist.net/profile/bigbodybenz",
        "username": "bigbodybenz",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/s/common/userimages/a9be9511-e1f0-4829-969e-e764b8af6b43_42x62_i?s=5124226568ca93b606aee351974d8056"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/s/common/userimages/a9be9511-e1f0-4829-969e-e764b8af6b43_42x62_i?s=5124226568ca93b606aee351974d8056"
          }
        }
      }
    },
    {
      "mal_id": 558036,
      "url": "https://myanimelist.net/reviews.php?id=558036",
      "type": "anime",
      "reactions": {
        "overall": 0,
        "nice": 0,
        "love_it": 0,
        "funny": 0,
        "confusing": 0,
        "informative": 0,
        "well_written": 0,
        "creative": 0
      },
      "date": "2025-04-08T16:01:00+00:00",
      "review": "Just finished Ameku Takao no Suiri Karte on Animyne, and I’m completely hooked! This isn’t your typical medical drama—it’s a brilliantly crafted detective story disguised as a hospital anime, with Dr. Ameku Takao playing the role of both genius diagnostician and emotional healer. What makes this series stand out is its perfect balance of cold, clinical logic and raw human drama. Each case feels like a puzzle, with symptoms as clues and diagnoses as revelations—but the real magic happens in how these medical mysteries tie into the patients’ lives (and sometimes, the doctors’ own struggles). The way Takao pieces together illnesses isn’t just smart—it’s thrilling, likewatching a Sherlock Holmes of medicine at work.\n\nThe supporting cast adds so much depth, from the skeptical colleagues who challenge Takao’s methods to the patients whose stories hit harder than expected. The anime doesn’t shy away from ethical gray areas, either—some diagnoses come with tough choices, and not every solution is clean or comforting.",
      "score": 8,
      "tags": ["Recommended"],
      "is_spoiler": false,
      "is_preliminary": false,
      "episodes_watched": null,
      "entry": {
        "mal_id": 58600,
        "url": "https://myanimelist.net/anime/58600/Ameku_Takao_no_Suiri_Karte",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1096/147327.jpg?s=a2bffacf88f1a17a10cba7937f9a5754",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1096/147327t.jpg?s=a2bffacf88f1a17a10cba7937f9a5754",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1096/147327l.jpg?s=a2bffacf88f1a17a10cba7937f9a5754"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1096/147327.webp?s=a2bffacf88f1a17a10cba7937f9a5754",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1096/147327t.webp?s=a2bffacf88f1a17a10cba7937f9a5754",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1096/147327l.webp?s=a2bffacf88f1a17a10cba7937f9a5754"
          }
        },
        "title": "Ameku Takao no Suiri Karte"
      },
      "user": {
        "url": "https://myanimelist.net/profile/bigbodybenz",
        "username": "bigbodybenz",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/s/common/userimages/a9be9511-e1f0-4829-969e-e764b8af6b43_42x62_i?s=5124226568ca93b606aee351974d8056"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/s/common/userimages/a9be9511-e1f0-4829-969e-e764b8af6b43_42x62_i?s=5124226568ca93b606aee351974d8056"
          }
        }
      }
    },
    {
      "mal_id": 558035,
      "url": "https://myanimelist.net/reviews.php?id=558035",
      "type": "anime",
      "reactions": {
        "overall": 0,
        "nice": 0,
        "love_it": 0,
        "funny": 0,
        "confusing": 0,
        "informative": 0,
        "well_written": 0,
        "creative": 0
      },
      "date": "2025-04-08T16:01:00+00:00",
      "review": "Just finished Dr. Stone: Science Future on Animyne, and wow—this season takes the series to a whole new level! Senku and the gang are back with even more mind-blowing inventions, but what really makes this season shine is how it pushes the boundaries of what science means in their world. The character development is phenomenal—Chrome’s evolution from an eager student to a true scientific pioneer is incredibly satisfying, and Gen’s strategic mind gets even sharper, making him one of the most entertaining wild cards in the series. The new faction introduces a brilliant ideological clash, forcing our heroes to question not just how to rebuild civilization,but what kind of civilization they should create. The debates about ethics, progress, and power give the story real philosophical weight without slowing down the excitement.\n\nAnd of course, the science is as cool as ever—every invention feels like a mix of genius and madness, and the way the anime visualizes complex concepts keeps it all engaging. The animation brings both the emotional moments and the explosive experiments to life with vibrant energy.",
      "score": 9,
      "tags": ["Recommended"],
      "is_spoiler": false,
      "is_preliminary": false,
      "episodes_watched": null,
      "entry": {
        "mal_id": 57592,
        "url": "https://myanimelist.net/anime/57592/Dr_Stone__Science_Future",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1403/146479.jpg?s=300d224aef092dfc270ebe27172afde6",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1403/146479t.jpg?s=300d224aef092dfc270ebe27172afde6",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1403/146479l.jpg?s=300d224aef092dfc270ebe27172afde6"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1403/146479.webp?s=300d224aef092dfc270ebe27172afde6",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1403/146479t.webp?s=300d224aef092dfc270ebe27172afde6",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1403/146479l.webp?s=300d224aef092dfc270ebe27172afde6"
          }
        },
        "title": "Dr. Stone: Science Future"
      },
      "user": {
        "url": "https://myanimelist.net/profile/bigbodybenz",
        "username": "bigbodybenz",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/s/common/userimages/a9be9511-e1f0-4829-969e-e764b8af6b43_42x62_i?s=5124226568ca93b606aee351974d8056"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/s/common/userimages/a9be9511-e1f0-4829-969e-e764b8af6b43_42x62_i?s=5124226568ca93b606aee351974d8056"
          }
        }
      }
    },
    {
      "mal_id": 558034,
      "url": "https://myanimelist.net/reviews.php?id=558034",
      "type": "anime",
      "reactions": {
        "overall": 0,
        "nice": 0,
        "love_it": 0,
        "funny": 0,
        "confusing": 0,
        "informative": 0,
        "well_written": 0,
        "creative": 0
      },
      "date": "2025-04-08T16:00:00+00:00",
      "review": "Just binged Sakamoto Days on Animyne, and I’m kicking myself for not watching it sooner! This anime is a non-stop thrill ride—mixing over-the-top action with laugh-out-loud comedy in a way that feels fresh and exhilarating. What really sets Sakamoto Days apart is its brilliant character dynamics. Sakamoto himself is a legend—a former top-tier assassin turned goofy convenience store dad, but still terrifying when he needs to be. The contrast between his chill, food-loving personality and his insane combat skills never gets old. And the supporting cast? Perfection. Shin’s internal panic as the \"straight man\" to Sakamoto’s absurdity is hilarious, while Lu’s deadly loyalty adds both heartand badass fight scenes. Even the villains have so much personality—everyone feels like they could carry their own spin-off.",
      "score": 8,
      "tags": ["Recommended"],
      "is_spoiler": false,
      "is_preliminary": false,
      "episodes_watched": null,
      "entry": {
        "mal_id": 58939,
        "url": "https://myanimelist.net/anime/58939/Sakamoto_Days",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1026/146459.jpg?s=65798583fec6c80cb7d48a96fcd8ec6b",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1026/146459t.jpg?s=65798583fec6c80cb7d48a96fcd8ec6b",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1026/146459l.jpg?s=65798583fec6c80cb7d48a96fcd8ec6b"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1026/146459.webp?s=65798583fec6c80cb7d48a96fcd8ec6b",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1026/146459t.webp?s=65798583fec6c80cb7d48a96fcd8ec6b",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1026/146459l.webp?s=65798583fec6c80cb7d48a96fcd8ec6b"
          }
        },
        "title": "Sakamoto Days"
      },
      "user": {
        "url": "https://myanimelist.net/profile/bigbodybenz",
        "username": "bigbodybenz",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/s/common/userimages/a9be9511-e1f0-4829-969e-e764b8af6b43_42x62_i?s=5124226568ca93b606aee351974d8056"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/s/common/userimages/a9be9511-e1f0-4829-969e-e764b8af6b43_42x62_i?s=5124226568ca93b606aee351974d8056"
          }
        }
      }
    },
    {
      "mal_id": 558030,
      "url": "https://myanimelist.net/reviews.php?id=558030",
      "type": "anime",
      "reactions": {
        "overall": 0,
        "nice": 0,
        "love_it": 0,
        "funny": 0,
        "confusing": 0,
        "informative": 0,
        "well_written": 0,
        "creative": 0
      },
      "date": "2025-04-08T15:23:00+00:00",
      "review": "An intense, stylish, but often times overambitious sports anime with a hefty dose of shounen absurdity. Intro Blue Lock portrays soccer as an ego-driven death game wrapped in capitalism and shounen melodrama. It's intense, absurd, and a little bit horny. And honestly, that's what makes it so damn entertaining - but it's not without its issues. Storytelling/Pacing The series spans a standard 24 episodes, which should be enough to tell a tightly paced story. However, the show gets heavily bogged down by its own shounen tropes and poor pacing. The series builds tension well, but too often these moments are buried under bloated internal monologues - especially from Isagi.While the psychological aspect is cool at first, the constant ego rants lose impact fast. Isagi's internal monologues are far too often less character exploration and more faux intellectual drivel, and it kills the pacing. Hard. He doesn't develop so much as absorb philosophies like he's a twinky sponge. The matches, as interesting as they are visually, often fall into the realm of Filler Lane, where the characters have to go through an uphill battle in their own minds each time. This is redundant. Either make it more sparse or have different things happen.\n\nThere's an undeniable sense that the show is getting high on its own excess. But when everything is life-or-death... nothing is. It numbs you. High drama becomes background noise. After a while, watching Blue Lock is like listening to Merzbow on top of Kendrick Lamar. It's brilliance beneath a layer of pure exhaustion.\n\nVisuals\n\nThat said, when Blue Lock does fire on all cylinders, it's absolutely brilliant. The animation is top fucking tier in both technical and artistic quality - brimming with passion in every frame, every major character design full of thematic cohesion. The character designs are always so damn sharp, exaggerated, and full of personality. I'll concede that for some of the supporting cast, they fall into the realm of generic anime high schoolers, but it's not a dealbreaker. I would've preferred it to be more of a spectacle, even with less focus on side characters, but for the main cast? Oh yeah, they nailed it. Bachira has that childlike wonder in his eyes and even his hair, Isagi is determined yet youthful, Rin is...okay, Rin is basically just a taller version of Isagi, just with 20% more cynicism. The way the supernatural/psychedelic elements are shown is really great, too - it really utilizes the medium to its advantage by showing a metaphor for how locked in these guys are on the field, even if the ego monsters are a bit jarring. Despite the sensory overload this show is so fond of, the direction knows how to land emotional beats when it matters most. They take this shit so seriously that it can feel like people are dying out here, even when it's \"just\" a soccer game. But since we're talking about animation: why use 3D models for distant characters? It just pulls me out of the scene when there's a clear difference in art styles, even if it's just for select scenes. They look like scrapped PS2 models - cheap and stiff, kinda like the music.\n\nSoundtrack\n\nMusic in Blue Lock is a mixed bag for me. I love the first OP, like the rest of the OPs and EDs, and don't care much for the background music. The OPs really sell that aggressive, youthful conquest for victory - I can feel Bachira's indulgent yet disciplined passion in every note, and the EDs are cute and sentimental. BGM in this series feels like generic electronic-style sports music, it doesn't do anything particularly interesting to hype scenes up and its composition is...fine. I would've been okay with generic music if it fit the tone (sports can be kind of stale) but Blue Lock is anything BUT generic. Why not go all-out with tunes that catch you off guard? The BGM tries to be energetic but lands somewhere between Skrillex impersonator and the soundtrack to a Fortnite crypto scam. I would've loved to see some Masafumi Takada-esque EDM bangers a la Danganronpa V3 to soundtrack the wild action that occurs, or hell, even some banging cyber metal. There was a lot of room to experiment here, but the chance was simply not taken.\n\nThemes\n\nBlue Lock actually has something to say. It's not just about soccer: it's about ego, ambition, and what it means to pursue greatness with complete disregard for teamwork or tradition. It's a sports anime with the plot of a shounen death game, without the death but with all the philosophical dread. I'm not sold on the philosophy it's going for, but what matters most is its believability. These are soccer players with the drive to be the best at any cost - and I can completely see how they come to their primarily self-fulfilling conclusions. It definitely doesn't shy away from showing other perspectives too. Isagi gets treated like a self-serving dick more as the series progresses, and I found it pretty funny how they call out him trying to be the main character of the story. It's no labyrinthine debate, but I'm glad the showrunners are at least a little self-aware. Blue Lock has something to say, but what adds layers is that it never really gives you a straight moral to take. Personally, I see Isagi as a well-meaning occasional bonehead whose ego may eventually eat him alive, but you might see him as a complete asshole that has no regard for his friends. These are conversations that are worth having, and as a sucker for philosophy, I definitely want to talk to some people about how they view the characterization at play here. Despite its interesting themes, however, it can be a little too unsubtle in its delivery at times. I don't need everything to be super nuanced and intricate, but I feel that a lot of the time, Blue Lock kicks back on having clear-cut motivations for everyone that leave little room for intrigue. The show would've done this better if it took more time to build specific perspectives instead of it being primarily an ensemble cast, especially when a few characters rely way too heavily on tropes. (looking at you, Tokimitsu)\n\nTone\n\nTonally, Blue Lock lives in this really odd space between hardcore serious sports shounen and off-the-wall comedy. It's not a perfect contrast by any means, but I'd say that its flaws add more merit and memorability to it, which is an absolute win in my book. Are some of the voice actors going way too hard? Absolutely. But I'd much rather have that than phoned-in performances with nothing interesting going on.\n\nMy Strange Addiction\n\nOkay, let me just break character for a second, because I need to talk about my one true love, Meguru Bachira. This man quickly became my husbando as the series progressed. He's so cute, I love how driven he is, how much romantic tension there is between him and the rest of the cast, and just the sheer passion he has for soccer above LITERALLY anything else. He's the perfect protagonist, and I didn't even realize he was a protagonist until he'd already stolen my heart. I love how he perfectly captures the themes of ego and ambition by being the centerpiece - driven by pure love and passion for everyone on the team via the realm of soccer. Everything about the way he thinks and plays is this perfect harmony of his worldview tying into every action he takes. It's gorgeous. Beyond all the analysis though, my emotional reaction to him is so strong that I just NEED to get this out. What an amazing little creature.\n\nOutro\n\nBlue Lock is so far from perfection it may as well be allergic to it - but it's got style, guts, and a few standout moments that make the ride worth it. Just don't expect a masterpiece. Expect an over-the-top shounen about egos and highly queer existential crises.",
      "score": 7,
      "tags": ["Recommended"],
      "is_spoiler": false,
      "is_preliminary": false,
      "episodes_watched": null,
      "entry": {
        "mal_id": 49596,
        "url": "https://myanimelist.net/anime/49596/Blue_Lock",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1258/126929.jpg?s=2eb175e7b036a4218c7267df613067c0",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1258/126929t.jpg?s=2eb175e7b036a4218c7267df613067c0",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1258/126929l.jpg?s=2eb175e7b036a4218c7267df613067c0"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1258/126929.webp?s=2eb175e7b036a4218c7267df613067c0",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1258/126929t.webp?s=2eb175e7b036a4218c7267df613067c0",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1258/126929l.webp?s=2eb175e7b036a4218c7267df613067c0"
          }
        },
        "title": "Blue Lock"
      },
      "user": {
        "url": "https://myanimelist.net/profile/angecritter",
        "username": "angecritter",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/s/common/userimages/f32f4f22-09ba-40bf-ac2f-3bfa21043c53_42x62_i?s=5991fddddb9027e0375b3680ea549432"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/s/common/userimages/f32f4f22-09ba-40bf-ac2f-3bfa21043c53_42x62_i?s=5991fddddb9027e0375b3680ea549432"
          }
        }
      }
    },
    {
      "mal_id": 558025,
      "url": "https://myanimelist.net/reviews.php?id=558025",
      "type": "anime",
      "reactions": {
        "overall": 0,
        "nice": 0,
        "love_it": 0,
        "funny": 0,
        "confusing": 0,
        "informative": 0,
        "well_written": 0,
        "creative": 0
      },
      "date": "2025-04-08T14:19:00+00:00",
      "review": "Shingeki no Kyojin is a series that is one of a kind. It's a masterpiece in its own standing and has both excelling writing and visuals to match. Since first watching Eren roll that boulder to cover the wall in season 1, I have followed this anime with much interest as the makers of this anime have dedicated the series to be just as well carefully crafted. I could make an individual review of each season, but I'd rather just make one for this ending. Attack on Titan started with 2 of the strongest seasons in anime without any signs of showing flaws. From thefirst episode onwards, it seems that this anime truly had the love and attention it deserves. The manga knew it was a goldmine, and the anime producers knew that they had a golden classic. \n\nThe crazy part is that none of this is too ambitious to write. The anime is truly a 10/10 human work of art despite it's shortcomings. \nI would say, the first season is practically a perfect run, as close to perfect as you will ever get. Same with the second season. The third season is where the series begins to show signs of drag and boring segments. Even so, the ending of season 3 went back to a 10, as well as most of season 4. From there, I could only describe that this show really gets confusing in its serial catalogue. Part 1, part 2, final, the finale, etc. Well just say, Attack on titan has seasons 1-5 plus the ending. Yeah, that's a bit easier to group. \nFrom season 4 onwards, this anime shows a mix of both 10/10 masterpiece episodes and 5/10 'meh' filler episodes. \nFlaws:\nIn the end, looking at AOT today, I can still say that as a whole its rightly a 10/10 anime. But the flaws are always going to be the plot writing. I have a theory that the creators thought about the start and end, but only partially. Like, they gave a few hidden foreshadowing in the beginning, but the end was mostly improvised. It wouldn't be too outlandish to find this as true for an action anime. Like, remember in the early seasons the plot was the titans are a result of a supernatural 'girl meets devil' story to later be 'titans are actually people' story? Yeah, I remembers. \n\nAll I'm saying is that I think people give the creators too much omnipotent credit when they could have easily just changed the story to shape the ending during production.  The start and ending of Attack on Titan is almost a literal reflection that MAYBE there was some recons that happened. \nThis is why some later episodes felt flat, because it just seemed like the creators started a big action story, and later decided how to fill those gaps in the plot. They did this by having characters, like LEVI, that lose their individuality and just unite to fulfill the main plot, introducing new characters just for the sake of a new plot(the Marleyans), how they forget about Annie's crimes, how they introduce the royal family, how they just keep giving Eren more and more powers as the Attack titan. \n\nIf you asked me, I'd say the charm of Attack on Titan ended with Reiner and Bertolt's secret on the wall. Sure, it led to the most intense part of Season 2, but man did it burst a balloon with the main plot. After that, the main story seems to spiral into further and further \"but wait actually\" moments that felt like cheap recons in consistency. \n\nThis is an anime about 3 main protagonist, that eventually become dull and empty vessels for the main plot. This anime is awesome to watch, but ultimately even the best shows can be sullied by poor direction. Even so, this anime is a unique masterpiece.",
      "score": 10,
      "tags": ["Recommended"],
      "is_spoiler": false,
      "is_preliminary": false,
      "episodes_watched": null,
      "entry": {
        "mal_id": 51535,
        "url": "https://myanimelist.net/anime/51535/Shingeki_no_Kyojin__The_Final_Season_-_Kanketsu-hen",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1279/131078.jpg?s=d4ef050078004452cbab63ef65118f47",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1279/131078t.jpg?s=d4ef050078004452cbab63ef65118f47",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1279/131078l.jpg?s=d4ef050078004452cbab63ef65118f47"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1279/131078.webp?s=d4ef050078004452cbab63ef65118f47",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1279/131078t.webp?s=d4ef050078004452cbab63ef65118f47",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1279/131078l.webp?s=d4ef050078004452cbab63ef65118f47"
          }
        },
        "title": "Shingeki no Kyojin: The Final Season - Kanketsu-hen"
      },
      "user": {
        "url": "https://myanimelist.net/profile/OhsnapitsDavid",
        "username": "OhsnapitsDavid",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/s/common/userimages/3593e91e-849c-4688-9038-c4045e226985_225w?s=c9c7dd69fb397fc1f66a592f4c9e7c30"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/s/common/userimages/3593e91e-849c-4688-9038-c4045e226985_225w?s=c9c7dd69fb397fc1f66a592f4c9e7c30"
          }
        }
      }
    },
    {
      "mal_id": 558024,
      "url": "https://myanimelist.net/reviews.php?id=558024",
      "type": "anime",
      "reactions": {
        "overall": 0,
        "nice": 0,
        "love_it": 0,
        "funny": 0,
        "confusing": 0,
        "informative": 0,
        "well_written": 0,
        "creative": 0
      },
      "date": "2025-04-08T14:17:00+00:00",
      "review": "The synopsis here on MAL was taken straight from the description of the visual novel game, which I did not play. It hardly matches the content of the anime. The anime does not seem to cover most of the games story and misses any kind of introductions. So the episodes are kind of random and miss a continuous plot. It's basically just the girls partaking in random events and the supposed main character Tomohiro Izumi is rarely spotted. Probably the anime is supposed to complement the game, but for a standalone series, I think there is just too much plot missing.",
      "score": 5,
      "tags": ["Mixed Feelings"],
      "is_spoiler": false,
      "is_preliminary": false,
      "episodes_watched": null,
      "entry": {
        "mal_id": 56461,
        "url": "https://myanimelist.net/anime/56461/Hamidashi_Creative",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1713/144761.jpg?s=daea96a83b18bcc1cee1382d1ced9995",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1713/144761t.jpg?s=daea96a83b18bcc1cee1382d1ced9995",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1713/144761l.jpg?s=daea96a83b18bcc1cee1382d1ced9995"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1713/144761.webp?s=daea96a83b18bcc1cee1382d1ced9995",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1713/144761t.webp?s=daea96a83b18bcc1cee1382d1ced9995",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1713/144761l.webp?s=daea96a83b18bcc1cee1382d1ced9995"
          }
        },
        "title": "Hamidashi Creative"
      },
      "user": {
        "url": "https://myanimelist.net/profile/Ecchlord",
        "username": "Ecchlord",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/s/common/userimages/3f4dc358-5c9a-478c-b04d-0769a30087c4_225w?s=3ec65121bb267485802ad3b09e1d51bf"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/s/common/userimages/3f4dc358-5c9a-478c-b04d-0769a30087c4_225w?s=3ec65121bb267485802ad3b09e1d51bf"
          }
        }
      }
    },
    {
      "mal_id": 558023,
      "url": "https://myanimelist.net/reviews.php?id=558023",
      "type": "anime",
      "reactions": {
        "overall": 0,
        "nice": 0,
        "love_it": 0,
        "funny": 0,
        "confusing": 0,
        "informative": 0,
        "well_written": 0,
        "creative": 0
      },
      "date": "2025-04-08T14:14:00+00:00",
      "review": "Char's Counterattack is a very distilled concentration of all the things that are right but also all of the things that are wrong with Yoshiyuki Tomino's first three series of Gundam. Firstly, positives. It's beautiful to look at and nicely atmospheric. The mobile suit combat is fast and frenetic and full of momentum. The new technical design is superb too. The design of the Nu Gundam evokes the original RX-78 well while looking like a sleek update. There is a real feeling of grim finality as Char throws a last, desperate gambit to change the relationship between Earth and space and the Federation have tothrow everything at the wall to stop him. War is hell and leads to unsentimental, unheroic deaths. The action trots along at a fair pace and it doesn't feel overlong at two hours. All this is good, all this works, all this is stuff Tomino has managed well before and is executed with a great degree of polish here. Also I think this is the closest Tomino's gotten to showing the newtype experience with any sense of real artistry, although the execution remains a tad overwrought.\n\nOn the downside, pretty much everything there is to dislike about the preceding TV series also makes it into the film, in forms that are all too recognisable. Characters once again make decisions that only make sense in Yoshiyuki Tomino's unfathomable understanding of human behaviour. I could have just about tolerated Char's turn to outright genocidal insanity that is the inciting incident, if there wasn't so much more weirdness ladled on top. The plot happening at all hinges on people assuming that Char will not do the thing that he has stated from the outset that he wants to do. There's also yet another incarnation of the \"young female newtype working for the antagonists has a connection to one of the protagonists\" which takes up a significant portion of the runtime, but also clearly can't be done justice to in that runtime, and offers very little that wasn't done before in any one of the five or six previous versions of it. Tomino remains incredibly interested in weird messy psychosexual relationships but remains almost incapable of rendering them with anything approximating believability. He is capable of showing naturally developing relationships, like he did with Mirai and Bright in Mobile Suit Gundam, and showing casual tenderness like with Amuro and Chan in this very film, but remains fixated on trying to grasp something stranger and less pleasant that remains just out of reach. As is tradition by this point it also ends fairly anticlimactically.\n\nIf you've already watched all the UC stuff and intend to continue onward you might as well watch this, but this is not a destination worth setting out for in and of itself.",
      "score": 4,
      "tags": ["Not Recommended"],
      "is_spoiler": false,
      "is_preliminary": false,
      "episodes_watched": null,
      "entry": {
        "mal_id": 87,
        "url": "https://myanimelist.net/anime/87/Kidou_Senshi_Gundam__Gyakushuu_no_Char",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1523/92371.jpg?s=340047644e00e35f94cb31330d08ff32",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1523/92371t.jpg?s=340047644e00e35f94cb31330d08ff32",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1523/92371l.jpg?s=340047644e00e35f94cb31330d08ff32"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1523/92371.webp?s=340047644e00e35f94cb31330d08ff32",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1523/92371t.webp?s=340047644e00e35f94cb31330d08ff32",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1523/92371l.webp?s=340047644e00e35f94cb31330d08ff32"
          }
        },
        "title": "Kidou Senshi Gundam: Gyakushuu no Char"
      },
      "user": {
        "url": "https://myanimelist.net/profile/09philj",
        "username": "09philj",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/s/common/userimages/ac472cb6-ebb6-4f2b-9c44-c1a6531348f2_225w?s=af3a8d42ba489e04e97f52e7f1665bfc"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/s/common/userimages/ac472cb6-ebb6-4f2b-9c44-c1a6531348f2_225w?s=af3a8d42ba489e04e97f52e7f1665bfc"
          }
        }
      }
    },
    {
      "mal_id": 558021,
      "url": "https://myanimelist.net/reviews.php?id=558021",
      "type": "anime",
      "reactions": {
        "overall": 0,
        "nice": 0,
        "love_it": 0,
        "funny": 0,
        "confusing": 0,
        "informative": 0,
        "well_written": 0,
        "creative": 0
      },
      "date": "2025-04-08T13:51:00+00:00",
      "review": "Hi If you have watched the Original story in Neon Genesis Evangelion you are already known that the Rebuild such as good idea To untangle the story, I think the idea of these movies was a good one, and with the succession of diverse works, Evangelion Neon Genesis left us with a big gap in terms of the ending, the fate of the characters, the fate of the world as well, and what exactly happened with the organization and what Shinji's father (Gendo) wanted to do. I also want to clarify some points in this movie. It seems that they combined the first part of the storyin the form of a movie, deleting many of the scenes that we relied on to convey to us the characters or even the story and their repressed desires. First, with a distortion, we see that Shinji saw Adam or Lilith, as they say, and this did not happen in the anime. The shot of Kaworu will not appear when he is nowhere, because he was waiting for Shinji to think. The characters that we are used to seeing depressed or doing wrong things, we see here in the movie as if they are normal characters in terms of their character type, or even normal. As I mentioned before, the structure of the characters and their interactions changed, and even Shinji, who was psychologically confused, was made into a loyal and savior brother.  As we know, his complex and the people around him were a source of his pain, and in the movie they became a source of strength. Also, some of the angels' forms, or should I say (monsters), were changed and the possibility of defeating them was almost realistic for the anime viewer, thanks to Hideaki Ono, who made both the fights and the character very realistic in terms of drama, psychological speed, and depression. Even every episode has philosophical symbols that evoke reality, such as the hedgehog theory and even Friedrich Nietzsche's theory, and another philosophy from Arfried Schopenhauer about pessimism and how Shinji sees the world and others as a hell that he lives in every day. There are also religious symbols, such as the story of Lilith and Adam, which is almost made up and has no connection to reality in terms of building the story and how the angels were sent by God, who saw that humans do not deserve to live, but humans appeared in a form similar to ingratitude, as they kill the angels, as they claim, and this is actually what happens in Evangelion.  Corrupt belief is sometimes the cause of depression, due to what a person may believe and questions about creation and existence, and the meaning of life, which may or may not be important to others, unfortunately. I talked a lot, and thank you for your interaction in the post that I published previously on the site. I did not think that I would accept all this support from just the opinion of a failed person like me who does not rise to the level of becoming a critic. There are many things I want to talk about, but this is enough. Thank you again ❤️",
      "score": 9,
      "tags": ["Recommended"],
      "is_spoiler": false,
      "is_preliminary": false,
      "episodes_watched": null,
      "entry": {
        "mal_id": 2759,
        "url": "https://myanimelist.net/anime/2759/Evangelion_Movie_1__Jo",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/images/anime/7/74975.jpg?s=1e6ce191fc2b89dac96c1464a28f039b",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/7/74975t.jpg?s=1e6ce191fc2b89dac96c1464a28f039b",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/7/74975l.jpg?s=1e6ce191fc2b89dac96c1464a28f039b"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/images/anime/7/74975.webp?s=1e6ce191fc2b89dac96c1464a28f039b",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/7/74975t.webp?s=1e6ce191fc2b89dac96c1464a28f039b",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/7/74975l.webp?s=1e6ce191fc2b89dac96c1464a28f039b"
          }
        },
        "title": "Evangelion Movie 1: Jo"
      },
      "user": {
        "url": "https://myanimelist.net/profile/Gucci100",
        "username": "Gucci100",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/s/common/userimages/ef51458e-15f0-4121-ad6d-cef9f8e7380e_42x62_i?s=4351134fdd369b79c497ecce8ddfb2d4"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/s/common/userimages/ef51458e-15f0-4121-ad6d-cef9f8e7380e_42x62_i?s=4351134fdd369b79c497ecce8ddfb2d4"
          }
        }
      }
    },
    {
      "mal_id": 558020,
      "url": "https://myanimelist.net/reviews.php?id=558020",
      "type": "anime",
      "reactions": {
        "overall": 1,
        "nice": 0,
        "love_it": 0,
        "funny": 1,
        "confusing": 0,
        "informative": 0,
        "well_written": 0,
        "creative": 0
      },
      "date": "2025-04-08T13:18:00+00:00",
      "review": "I started it thinking about the unique concept. it was good at first but as the episode goes on it becomes bad to worse. All the break up story are same about childhood friends and not confessing their feelings which is annoying. The girls broke their hearts and refuse to let the feeling go. After that MC come to sympthaize them and again it's same every time without any variety. There is also another annoying part, after being dumped the girls go to their crush and crush's GF to build friendship and they successfully build it with mc's help. the crush and crush's gffill bad for the girl but they support her. The writer did it everytime without any difference. he just repeated the same thing three times with different characters. Man at least you can have someone hold grudge or try to get revenge or something, but no, it's the same annoying thing again and again. the only different thing was mc helping the introvert girl to get over her inferiority complex. I watched the whole season thinking it will get  better somewhere but it was just wastage of time.",
      "score": 4,
      "tags": ["Not Recommended"],
      "is_spoiler": false,
      "is_preliminary": false,
      "episodes_watched": null,
      "entry": {
        "mal_id": 57524,
        "url": "https://myanimelist.net/anime/57524/Make_Heroine_ga_Oosugiru",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1332/143513.jpg?s=30a04a15af78229c8f7a523db9edbb45",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1332/143513t.jpg?s=30a04a15af78229c8f7a523db9edbb45",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1332/143513l.jpg?s=30a04a15af78229c8f7a523db9edbb45"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1332/143513.webp?s=30a04a15af78229c8f7a523db9edbb45",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1332/143513t.webp?s=30a04a15af78229c8f7a523db9edbb45",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1332/143513l.webp?s=30a04a15af78229c8f7a523db9edbb45"
          }
        },
        "title": "Make Heroine ga Oosugiru!"
      },
      "user": {
        "url": "https://myanimelist.net/profile/eris717",
        "username": "eris717",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/images/kaomoji_mal_white.png"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/images/kaomoji_mal_white.png"
          }
        }
      }
    },
    {
      "mal_id": 558013,
      "url": "https://myanimelist.net/reviews.php?id=558013",
      "type": "anime",
      "reactions": {
        "overall": 3,
        "nice": 1,
        "love_it": 0,
        "funny": 1,
        "confusing": 0,
        "informative": 1,
        "well_written": 0,
        "creative": 0
      },
      "date": "2025-04-08T12:09:00+00:00",
      "review": "The writer's artsy self-insert fantasy (and barely disguised foot fetish and romance pedophilia of a teacher with a student). She's 27. MC is 15, a first-year in HS yet looks older even according to dialogue and is working and worrying about becoming a shoemaker and acting like an adult and taking placement exams... it sounds like they wrote nearly an 18 year old in his last year of HS worrying about going into a trade school and a future career as a shoemaker, and then decided to make him 15 instead despite every reason not to because they wanted pedophilia. This is a lame version ofTo the Forest of Firefly Lights.\nThere is so much authorial vomit, exposition-dumping self-narration of the MC's inner thoughts by having the MC's voice actor read off extremely clunky and unnatural lines of prose like an audiobook.\nThis is a fundamental failure of storytelling:\n(There are only 2 characters in this movie, ignoring a few extremely brief mostly one-off noncharacters like the brother, the mother, and the bullies) The 2 characters spend entire montages of dates together hanging out, cheaply skipping the hard part of actually having the characters interact meaningfully, neither one ever actually says anything much to the other despite the plot both insisting that they now love each other and that their time together was life-affirming and the most meaningful thing ever etc, while at the same time revealing that they practically don't know anything about each other because they in fact didn't really say much of anything in all that time and in fact it becomes an absurd plot point that the teacher practically never told the MC anything. It wants to have its cake and eat it too but is too lazy even to buy a generic one let alone bake one. Ultimately their interaction is a series of empty scenes that say nothing meaningful elevated artificially in an impossible way because actually they've barely spoken to each other both in the audience's pov and in universe.\nThe ending is extremely forced (by absurd contrivance he's the only one who doesn't know about her) and comes across like the author self-inserting to play out some fantasy argument with an ex because of his romantic hangups. And the ending itself is mostly dumb and renders the nonstory pointless.\nThe ending is self contradictory with many of its themes: (vague spoilerish)\nShe was stuck day drinking there unable to move, but now actually that was her walking and he already saved her without doing anything. For some reason the solution to her problem that stemmed from being accused of pedophilia towards her student was to... engage in pedophilia with her student... sacrificing the story and themes in favor of pedophilia...\nMC was trying to save her, (then immediately gave up and was an asshole when she rejected him) yet instead of having him go back for her (being mature as every aspect of his coming of age story was meant to be moving towards), she runs after him... after rejecting him... despite that being pedophilia... because romancing a child is her finally moving forward as an adult (now, as opposed to her claim that she already had)... despite that going against exactly her core trauma in her subplot in the story which caused her to be stuck... It just feels like the author wants someone else to throw themselves at him rather than work for it himself (because this is a self insert) (she's a cardboard cutout of a manic pixie dreamboat for MC to sail away on). (And they only let her sob out 3 little sentences in response to his big angry monologue reveal that part of her passivity issue is she doesn't talk and just listens, 0 character growth, but she says he saved her so plz ignore contradictory show while they tell you how it be).\nLiterally all he had to do was have MC come back in after she's already crying and thus already shown her true feelings, he runs to her (rising crescendo) they embrace, the end, epilogue. Problem solved, he came onto her, she did nothing; themes intact, actual story, clap clap. But no. Absurd and heavyhanded unsubtle dialogue sperg instead along with cloying melodrama and hamfisted tone-deaf symbolism and messages.\nAnd that half-assed excuse for resolving the 'making her a pair of shoes' plot point was as trash as the shoes themselves; she wasn't even there, he's literally just showing it off to no one for the audience's benefit while self-narrating more audiobook.\nThere may have been the slightest allusion to her having miscarried a child from her implied prior relationship with a coworker as another reason why she's single/sad/stuck (and wondering if she'll ever be able to _ be a mother) and reason why seeing the child MC means so much to/heals her with their mother/child relationship parallels filling the role each one lacks, but I'm reaching at breadcrumbs here and probably just writing the story myself way beyond the low effort the writer put in.\nIt does have high budget art though so \"10/10, I like it when the pretty colors go by.\"",
      "score": 2,
      "tags": ["Not Recommended"],
      "is_spoiler": false,
      "is_preliminary": false,
      "episodes_watched": null,
      "entry": {
        "mal_id": 16782,
        "url": "https://myanimelist.net/anime/16782/Kotonoha_no_Niwa",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1597/112995.jpg?s=3019625e6461d7f97db6a2cf6497d2f8",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1597/112995t.jpg?s=3019625e6461d7f97db6a2cf6497d2f8",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1597/112995l.jpg?s=3019625e6461d7f97db6a2cf6497d2f8"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1597/112995.webp?s=3019625e6461d7f97db6a2cf6497d2f8",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1597/112995t.webp?s=3019625e6461d7f97db6a2cf6497d2f8",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1597/112995l.webp?s=3019625e6461d7f97db6a2cf6497d2f8"
          }
        },
        "title": "Kotonoha no Niwa"
      },
      "user": {
        "url": "https://myanimelist.net/profile/1stDecame4Danime",
        "username": "1stDecame4Danime",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/images/kaomoji_mal_white.png"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/images/kaomoji_mal_white.png"
          }
        }
      }
    },
    {
      "mal_id": 558009,
      "url": "https://myanimelist.net/reviews.php?id=558009",
      "type": "anime",
      "reactions": {
        "overall": 0,
        "nice": 0,
        "love_it": 0,
        "funny": 0,
        "confusing": 0,
        "informative": 0,
        "well_written": 0,
        "creative": 0
      },
      "date": "2025-04-08T11:45:00+00:00",
      "review": "This is the best season of mha in long time. Imagine all of the good plotlines of the story coming together with no filler and no need for any sort of side b plot. The animation is good and the moments of those first seasons are back. Characters come back everything is full circle it’s actually amazing how I care about characters who I thought didn’t matter at first or were some b side villains too. Please watch this it’s epic. I am a big fan of the early seasons and this one makes me think it was worth it same with season 6 butseason 6 had some animation trouble for a couple episode.",
      "score": 10,
      "tags": ["Recommended"],
      "is_spoiler": false,
      "is_preliminary": false,
      "episodes_watched": null,
      "entry": {
        "mal_id": 54789,
        "url": "https://myanimelist.net/anime/54789/Boku_no_Hero_Academia_7th_Season",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1529/140306.jpg?s=3e4bcfa2b7647924a6d1e94423b9361d",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1529/140306t.jpg?s=3e4bcfa2b7647924a6d1e94423b9361d",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1529/140306l.jpg?s=3e4bcfa2b7647924a6d1e94423b9361d"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1529/140306.webp?s=3e4bcfa2b7647924a6d1e94423b9361d",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1529/140306t.webp?s=3e4bcfa2b7647924a6d1e94423b9361d",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1529/140306l.webp?s=3e4bcfa2b7647924a6d1e94423b9361d"
          }
        },
        "title": "Boku no Hero Academia 7th Season"
      },
      "user": {
        "url": "https://myanimelist.net/profile/MartyExif",
        "username": "MartyExif",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/images/kaomoji_mal_white.png"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/images/kaomoji_mal_white.png"
          }
        }
      }
    },
    {
      "mal_id": 558007,
      "url": "https://myanimelist.net/reviews.php?id=558007",
      "type": "anime",
      "reactions": {
        "overall": 0,
        "nice": 0,
        "love_it": 0,
        "funny": 0,
        "confusing": 0,
        "informative": 0,
        "well_written": 0,
        "creative": 0
      },
      "date": "2025-04-08T11:21:00+00:00",
      "review": "I have seen the whole series, including the OVAs and films. I want to say up front, that if you do not like iyashikei, do not like moe, do not like the progression of this series by Hitotose, and do not like the characters, the films and ending of this series will not change your mind. Do not sit through all of the series just to get to the last film, because it really hinges on you already enjoying the series and its characters. I will not spoil anything that happens in this series through this review. All I talk about is what to expectfrom the series and what I found personally disappointing and well done.\n\nMy main issue with the moe in this series is it undermines the character growth. So many scenes are just each character doing their moe character trait which makes the characters feel one dimensional, despite the actual character growth there is in the series. The way Maon just whistles when she should be speaking, how Kanae repeats the same words twice (especially in the films), how Fu adds ‘node’ at the end of sentences for no reason, how Chihiro cries in every scene she’s in (Don’t even get me started on the duo that is Suzune and Takumi in the films), how the only trait of Sayori is she sucks at driving. I actually think Kaoru is the only normal character in this series, even though her and Norie literally act like a Japanese comedy duo. Many of the comedy scenes are just these character traits being displayed with little to no jokes or actual comical scenarios over and over again. Honestly, when there's no story progression I feel like I am watching the same scenes being played out in different ways. I'm quite baffled by the writing of the humor in this series. Junichi Sato has done amazing comedy in many series before this one, but it's almost comical in itself how one dimensional the humor is in Tamayura.\n\nAnother issue I have with this series is the way it tackles the subject matter of photography. I have seen slice of life series that tackle subjects where you can actually learn something from the subject here and there. I’m not talking about a lecture, but just tips and terminology thrown in to get the audience to understand, learn something, or look something up. Everyone has a smartphone now, not everything needs to be explained within the series. Tamayura does not do this outside of a couple scene transitions where you can tell they were talking about photography, but not to the audience. They even have an episode where a character is brought in and tries to talk about the technicalities and he’s told to be quiet. They do not talk about focus, exposure, lenses, ISO, Composition, aperture, depth of field, rule of thirds, etc. These are just some extremely common things. They don’t even bring up red light rooms once. If the series did not focus so much on using professional cameras, having characters who are supposed to be professionals, and submitting to professional contests, I wouldn’t be mentioning this. But it seems to take photography seriously without even talking about why photography is worthy of being taken seriously. The camera in this series is more of a tool to capture moments and is just a background element to the characters in this series. If I had not seen anime do all of these things (character building, humor, drama, romance) and teach its audience about the actual intricacies of its subject matter, I would not be so critical. However, I have (Honey and Clover, Nodame Cantabile, Big Windup to name a few), and the way photography is tackled in this series just seems amateur at best. It’s like making the focus of a series about bungee jumping, but only ever seeing bungee jumps right after they happen, and skip out on all of the safety and intricacies of it. \n\nThe music in this series is quite good, normally. There’s nothing particularly wrong with it. It’s fitting, its focus on mostly solo piano fits the setting and pacing of the show. However, if you have watched the series, you will know what I mean when I say they over play the Tamayura theme. I swear, every episode plays the main theme at least 3 times. If not more. The composer really should have created some more melodies, or changed the key, or made simpler versions, but I was getting sick of hearing this one melody and it’s multiple instrument arrangements half way through More Aggressive. You will be hearing this same exact melody, they don’t even arrange it in a different key. I am not sure why Junichi Sato was okay with this, I have never felt this way about anime he has directed before. \n\nHowever, I only realize I’m quite harsh on this series while writing this out. It almost feels like I don’t like it. However, I believe I am so harsh because the parts this series gets right are really good. The way it tackles grief and loss through Fu is handled realistically. No one gets over a death in one day. It’s a gradual process that takes time through many small moments of acceptance. This series does a great job at tackling that specific scenario really well. The way people are tip toeing around the loss of her father, how they want to say something but cannot, and how sometimes others also do not feel ready to talk about his loss either. It’s sad, because this part of the series is by far and away more mature than the humor and moe character traits. As I am writing and finishing up the series I realize why I am so torn over it. All of the scripts for this whole series feel like they were written by two different people. One side is the focus on realistically tackling grief and coming to terms with it. The other side is a moe iyashikei with high schoolers that act like they’re in middle school. If you do not like iyashikei and do not like moe, you will NOT like this series. However, anyone who is not bothered by those traits (they are prevalent in this series), and are possibly dealing with a loss in your life, Tamayura will be an excellent series for you to help you through that process. It tackles these subjects very well and with maturity.  \n\nThe entire series gets a 6/10 from me, not just Hitotose.",
      "score": 6,
      "tags": ["Mixed Feelings"],
      "is_spoiler": false,
      "is_preliminary": false,
      "episodes_watched": null,
      "entry": {
        "mal_id": 10232,
        "url": "https://myanimelist.net/anime/10232/Tamayura__Hitotose",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/images/anime/13/45368.jpg?s=6a33dd6330adb86c9eae0a6237cbfc19",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/13/45368t.jpg?s=6a33dd6330adb86c9eae0a6237cbfc19",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/13/45368l.jpg?s=6a33dd6330adb86c9eae0a6237cbfc19"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/images/anime/13/45368.webp?s=6a33dd6330adb86c9eae0a6237cbfc19",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/13/45368t.webp?s=6a33dd6330adb86c9eae0a6237cbfc19",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/13/45368l.webp?s=6a33dd6330adb86c9eae0a6237cbfc19"
          }
        },
        "title": "Tamayura: Hitotose"
      },
      "user": {
        "url": "https://myanimelist.net/profile/MrKuandohan",
        "username": "MrKuandohan",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/s/common/userimages/58230261-f038-4997-9673-ed7a22fb4abb_42x62_i?s=76ad79fe7fd1598c5d1578326c8f323e"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/s/common/userimages/58230261-f038-4997-9673-ed7a22fb4abb_42x62_i?s=76ad79fe7fd1598c5d1578326c8f323e"
          }
        }
      }
    },
    {
      "mal_id": 558006,
      "url": "https://myanimelist.net/reviews.php?id=558006",
      "type": "anime",
      "reactions": {
        "overall": 0,
        "nice": 0,
        "love_it": 0,
        "funny": 0,
        "confusing": 0,
        "informative": 0,
        "well_written": 0,
        "creative": 0
      },
      "date": "2025-04-08T11:04:00+00:00",
      "review": "Ultimately NEET Ninja is a failed Jack of All Trades that uses most of the tropes & stereotypes in the medium. It lacks story, cohesion & basic formatting to the point some episodes are a jumbled blob full of conflicting tones, genres & ideas. It's another standard 'turn your brain off' perverted anime where it never excels at anything other than Voice Acting & at times Comedy. It lacks any depth or explanation to its world or characters & the only redeemable portions of the show are thanks to the voice actors, referential gags and a number of interactions between side characters, who themselves arestereotypes &amp; references.\n\nThe side characters &amp; their antics were the only reason I stayed around, as they provided consistent entertainment. Sadly, the side characters only start appearing after ep2 which means you're stuck with a rather intolerable duo for 24 minutes before things start to get arguably entertaining. That’s not to say the jokes don’t get old or repetitive, as they definitely do but certain characters leave &amp; return long enough for the jokes to land again. I should also note that there are jokes about gender dysphoria, consent &amp; Japanese tropes e.g. low character ages. This is another reason why my score is low, even if it's a comedy, it's still disgusting. \n\nDepending on where you watch the show, it has either 24, 12 minute episodes or 12, 24 minute episodes, with the later using a jarring structure of featuring the OP &amp; ED’s multiple times in a single episode. It’s weird...\n\nI do not recommend watching this in its entirety HOWEVER if you can find highlights of the characters on media sharing sites, you may experience the best parts of the Anime.",
      "score": 4,
      "tags": ["Not Recommended"],
      "is_spoiler": false,
      "is_preliminary": false,
      "episodes_watched": null,
      "entry": {
        "mal_id": 58082,
        "url": "https://myanimelist.net/anime/58082/NEET_Kunoichi_to_Nazeka_Dousei_Hajimemashita",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1748/148595.jpg?s=9367cb184e998666e9384c07fcd095db",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1748/148595t.jpg?s=9367cb184e998666e9384c07fcd095db",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1748/148595l.jpg?s=9367cb184e998666e9384c07fcd095db"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1748/148595.webp?s=9367cb184e998666e9384c07fcd095db",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1748/148595t.webp?s=9367cb184e998666e9384c07fcd095db",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1748/148595l.webp?s=9367cb184e998666e9384c07fcd095db"
          }
        },
        "title": "NEET Kunoichi to Nazeka Dousei Hajimemashita"
      },
      "user": {
        "url": "https://myanimelist.net/profile/iwoply",
        "username": "iwoply",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/s/common/userimages/dd4d910e-40c4-4870-904a-0f02eb580959_42x62_i?s=1521dd9ca08e2fa56318a509d0405c14"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/s/common/userimages/dd4d910e-40c4-4870-904a-0f02eb580959_42x62_i?s=1521dd9ca08e2fa56318a509d0405c14"
          }
        }
      }
    },
    {
      "mal_id": 558005,
      "url": "https://myanimelist.net/reviews.php?id=558005",
      "type": "anime",
      "reactions": {
        "overall": 0,
        "nice": 0,
        "love_it": 0,
        "funny": 0,
        "confusing": 0,
        "informative": 0,
        "well_written": 0,
        "creative": 0
      },
      "date": "2025-04-08T10:47:00+00:00",
      "review": "My Neighbor Totoro is a timeless masterpiece that radiates warmth, wonder, and simplicity. From its gentle storytelling to its whimsical worldbuilding, it perfectly captures the magic of childhood and the quiet beauty of everyday life. Studio Ghibli has created something truly special here—an anime that feels like a warm hug from start to finish. The film’s emotional core lies in the relationship between the two sisters, Mei and Satsuki, brought to life by phenomenal voice acting. Their performances felt so natural and heartfelt, it was impossible not to be completely drawn in. Mei's playful curiosity and Satsuki's blend of maturity and vulnerability made them incredibly endearingand relatable.\n\nWhat makes this experience a bit bittersweet for me is the realization that I came to this film later in life. I only recently began my anime journey, and I can't help but wish I had seen My Neighbor Totoro as a child. I know it would’ve held a special place in my heart back then, just as it does now. That thought brings a touch of sadness, but also a deep appreciation that I still get to enjoy it, even if it's a bit later than most.\n\nThere’s a purity to this film that’s rare. It doesn’t rely on dramatic conflict or high-stakes tension. Instead, it invites you into a serene world where magic exists in the ordinary, and kindness is at the center of everything. It’s sweet, it’s charming, and it left me with a quiet joy that lingered long after the credits rolled.\n\nMy Neighbor Totoro isn’t just a film—it’s a feeling. And for me, that feeling was absolutely unforgettable.",
      "score": 10,
      "tags": ["Recommended"],
      "is_spoiler": false,
      "is_preliminary": false,
      "episodes_watched": null,
      "entry": {
        "mal_id": 523,
        "url": "https://myanimelist.net/anime/523/Tonari_no_Totoro",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1110/147278.jpg?s=fc009604be98c20956c87d1c80d677e4",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1110/147278t.jpg?s=fc009604be98c20956c87d1c80d677e4",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1110/147278l.jpg?s=fc009604be98c20956c87d1c80d677e4"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1110/147278.webp?s=fc009604be98c20956c87d1c80d677e4",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1110/147278t.webp?s=fc009604be98c20956c87d1c80d677e4",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1110/147278l.webp?s=fc009604be98c20956c87d1c80d677e4"
          }
        },
        "title": "Tonari no Totoro"
      },
      "user": {
        "url": "https://myanimelist.net/profile/BerryBlitz",
        "username": "BerryBlitz",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/images/kaomoji_mal_white.png"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/images/kaomoji_mal_white.png"
          }
        }
      }
    },
    {
      "mal_id": 558004,
      "url": "https://myanimelist.net/reviews.php?id=558004",
      "type": "anime",
      "reactions": {
        "overall": 0,
        "nice": 0,
        "love_it": 0,
        "funny": 0,
        "confusing": 0,
        "informative": 0,
        "well_written": 0,
        "creative": 0
      },
      "date": "2025-04-08T10:33:00+00:00",
      "review": "What can I say? This movie has a simple plot yet manages to feel unique at the same time. It’s heavy on the action, but it doesn’t sacrifice an engaging storyline for mindless fighting. The decision to adapt this story into a movie was a great one—it’s paced just right, keeping you hooked without dragging or rushing through the key moments The art style is impressive, especially for a film that came out in 2007. Set in the Sengoku period, it avoids vibrant colors, which fits the tone perfectly and enhances the gritty atmosphere. The action sequences are a standout—extremely well-choreographed and brimming with a hypevibe that feels ahead of its time animation-wise. It’s clear this movie pushed boundaries for its era.\n\nAt its core, the evolving relationship between Nanashi and Kotarou is a strong point, showcasing something beyond just swordplay. That said, even with all the action, the film doesn’t rely on it to carry the experience. The plot holds its own, giving the fights meaning and weight.\n\nStill, there’s room for improvement. If the story had explored Nanashi’s motivations a bit more, it could have elevated the whole thing even further. His backstory remains a mystery for the most part, left up to the viewer’s imagination. While that can be intriguing, a little more depth might’ve made him even more compelling.",
      "score": 8,
      "tags": ["Recommended"],
      "is_spoiler": false,
      "is_preliminary": false,
      "episodes_watched": null,
      "entry": {
        "mal_id": 2418,
        "url": "https://myanimelist.net/anime/2418/Stranger__Mukou_Hadan",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/images/anime/9/87066.jpg?s=26da62b1c95c4f8a2df5568fc767e105",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/9/87066t.jpg?s=26da62b1c95c4f8a2df5568fc767e105",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/9/87066l.jpg?s=26da62b1c95c4f8a2df5568fc767e105"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/images/anime/9/87066.webp?s=26da62b1c95c4f8a2df5568fc767e105",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/9/87066t.webp?s=26da62b1c95c4f8a2df5568fc767e105",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/9/87066l.webp?s=26da62b1c95c4f8a2df5568fc767e105"
          }
        },
        "title": "Stranger: Mukou Hadan"
      },
      "user": {
        "url": "https://myanimelist.net/profile/lilgapple",
        "username": "lilgapple",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/s/common/userimages/b6209690-aff9-4683-8d33-71fbe175881c_42x62_i?s=791adf579a4b3a0d502d5ebb36e8b623"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/s/common/userimages/b6209690-aff9-4683-8d33-71fbe175881c_42x62_i?s=791adf579a4b3a0d502d5ebb36e8b623"
          }
        }
      }
    },
    {
      "mal_id": 557997,
      "url": "https://myanimelist.net/reviews.php?id=557997",
      "type": "anime",
      "reactions": {
        "overall": 0,
        "nice": 0,
        "love_it": 0,
        "funny": 0,
        "confusing": 0,
        "informative": 0,
        "well_written": 0,
        "creative": 0
      },
      "date": "2025-04-08T09:58:00+00:00",
      "review": "The art style is nice and fitting. This anime has amazing animation and build up up to this point, but the round up of characters is very bad and many flaws, they just didnt react in any realists and normal way, manu will like the story. Its just that the story of this season just became very predictable and stupid, constant a*spulls everywhere, heros making stupid decisions just for the sake of the story progress is so unnecesairy...in what world would a hero defeat a villain and just watch and let him save another villain who will pull a even bigger a*spull......",
      "score": 5,
      "tags": ["Mixed Feelings"],
      "is_spoiler": false,
      "is_preliminary": false,
      "episodes_watched": null,
      "entry": {
        "mal_id": 54789,
        "url": "https://myanimelist.net/anime/54789/Boku_no_Hero_Academia_7th_Season",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1529/140306.jpg?s=3e4bcfa2b7647924a6d1e94423b9361d",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1529/140306t.jpg?s=3e4bcfa2b7647924a6d1e94423b9361d",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1529/140306l.jpg?s=3e4bcfa2b7647924a6d1e94423b9361d"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1529/140306.webp?s=3e4bcfa2b7647924a6d1e94423b9361d",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1529/140306t.webp?s=3e4bcfa2b7647924a6d1e94423b9361d",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1529/140306l.webp?s=3e4bcfa2b7647924a6d1e94423b9361d"
          }
        },
        "title": "Boku no Hero Academia 7th Season"
      },
      "user": {
        "url": "https://myanimelist.net/profile/Rajkkan",
        "username": "Rajkkan",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/s/common/userimages/24282376-422b-4b75-8f08-6c3b4de8b354_225w?s=7dbb4a8f9ed2142b912bf64caa5807ba"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/s/common/userimages/24282376-422b-4b75-8f08-6c3b4de8b354_225w?s=7dbb4a8f9ed2142b912bf64caa5807ba"
          }
        }
      }
    },
    {
      "mal_id": 557994,
      "url": "https://myanimelist.net/reviews.php?id=557994",
      "type": "anime",
      "reactions": {
        "overall": 0,
        "nice": 0,
        "love_it": 0,
        "funny": 0,
        "confusing": 0,
        "informative": 0,
        "well_written": 0,
        "creative": 0
      },
      "date": "2025-04-08T09:21:00+00:00",
      "review": "Bungo Stray Dogs 2nd Season is an extremely solid follow-up to the first season and a worthy contender. Before I say anything else, this season is easily better than the first, Much more action packed and the arcs are alot more fleshed out. The plot of the anime is actually really thick this season, especially with the First Arc containing alot of lore for Dazai and on the Port Mafia itself. The character development throughout this season is really neat aswell there are some noticeable changes in behavior in some characters so be on the lookout for that because it can be really cool to see.Some moments are also really wholesome with the banter between characters and the non action or dramatic moments being really chill to watch.\n\nThe animation this season is noticeably better. Not with the character design but with the battles, they feel alot more fluid and honestly just look badass, I mean If you like badass fight scenes I'd watch the second season for that alone, there is a ton of them this time round. The backdrops themselves are pretty similar to the first season, with the locations being mostly the same with a few new areas shown on screen however it's nothing special. The OST this season Felt alot more mainstream, With the OP sounding like something you'd hear in a popular Osu! Beat map and something that would be Extremely Popular. \n\nOverall this was a very solid second season and does leave alot to be desired in a third season but that came out years ago. 8/10",
      "score": 8,
      "tags": ["Recommended"],
      "is_spoiler": false,
      "is_preliminary": false,
      "episodes_watched": null,
      "entry": {
        "mal_id": 32867,
        "url": "https://myanimelist.net/anime/32867/Bungou_Stray_Dogs_2nd_Season",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1572/133096.jpg?s=d89a2d674706d0975e7120018c306b5e",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1572/133096t.jpg?s=d89a2d674706d0975e7120018c306b5e",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1572/133096l.jpg?s=d89a2d674706d0975e7120018c306b5e"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1572/133096.webp?s=d89a2d674706d0975e7120018c306b5e",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1572/133096t.webp?s=d89a2d674706d0975e7120018c306b5e",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1572/133096l.webp?s=d89a2d674706d0975e7120018c306b5e"
          }
        },
        "title": "Bungou Stray Dogs 2nd Season"
      },
      "user": {
        "url": "https://myanimelist.net/profile/Spast1c",
        "username": "Spast1c",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/s/common/userimages/3bd06f33-c579-4545-9e98-8950c95ff7fc_225w?s=7a8e58237e06468031285e3e0eeec10c"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/s/common/userimages/3bd06f33-c579-4545-9e98-8950c95ff7fc_225w?s=7a8e58237e06468031285e3e0eeec10c"
          }
        }
      }
    },
    {
      "mal_id": 557993,
      "url": "https://myanimelist.net/reviews.php?id=557993",
      "type": "anime",
      "reactions": {
        "overall": 0,
        "nice": 0,
        "love_it": 0,
        "funny": 0,
        "confusing": 0,
        "informative": 0,
        "well_written": 0,
        "creative": 0
      },
      "date": "2025-04-08T09:19:00+00:00",
      "review": "No spoilers. This anime is a might darker than your typical save the world anime. It's based upon the age-old tale of a party called by destiny to defeat the demon king. However, the path forward is not so simple. it is fraught with subterfuge, chaos, and betrayal. The heroes have had 100 years to prepare for the demon king's revival, but so have the demons. The story is very unique for its class, and the art style is great (very aesthetic, but note that it is darker, so its colour palette is not as bright as other fantasy anime). If you're a fan of darkerisekai, or more complex storylines, or you need a break from Konosuba, give this a try.",
      "score": 9,
      "tags": ["Recommended"],
      "is_spoiler": false,
      "is_preliminary": false,
      "episodes_watched": null,
      "entry": {
        "mal_id": 28497,
        "url": "https://myanimelist.net/anime/28497/Rokka_no_Yuusha",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/images/anime/9/74374.jpg?s=8176ff140b996058804431ff9462d9d0",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/9/74374t.jpg?s=8176ff140b996058804431ff9462d9d0",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/9/74374l.jpg?s=8176ff140b996058804431ff9462d9d0"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/images/anime/9/74374.webp?s=8176ff140b996058804431ff9462d9d0",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/9/74374t.webp?s=8176ff140b996058804431ff9462d9d0",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/9/74374l.webp?s=8176ff140b996058804431ff9462d9d0"
          }
        },
        "title": "Rokka no Yuusha"
      },
      "user": {
        "url": "https://myanimelist.net/profile/TheeeeDynasty",
        "username": "TheeeeDynasty",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/images/kaomoji_mal_white.png"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/images/kaomoji_mal_white.png"
          }
        }
      }
    },
    {
      "mal_id": 557991,
      "url": "https://myanimelist.net/reviews.php?id=557991",
      "type": "anime",
      "reactions": {
        "overall": 20,
        "nice": 3,
        "love_it": 2,
        "funny": 6,
        "confusing": 7,
        "informative": 1,
        "well_written": 1,
        "creative": 0
      },
      "date": "2025-04-08T08:59:00+00:00",
      "review": "Frieren isn't deep. It's just empty in a pretty wrapper. So I watched Frieren, and honestly... I just couldn’t keep these thoughts to myself. People are constantly praising it for being emotional, thoughtful, and “beautifully slow.” And yeah, I get where they’re coming from. But to me, it felt more like someone telling me to stare at a river because it’s relaxing. Like… sure, it flows nicely — but where is the goal? What’s the point? There’s no real conflict, no antagonist that actually matters, no moral dilemma to chew on. The characters just kind of go through the motions without ever really being challenged. Even Frieren herself— her \"growth\" feels way too safe and linear. She slowly becomes more emotional, but never hits any serious internal wall or has to make a tough decision. It’s all just kind of... flat.\n\nAnd here’s the thing: the big message Frieren tries to deliver — that time, friendship, and shared memories are important . I figured that out a long time ago and built my own philosophy around it. So watching a show slowly spoon-feed me an idea I already understand just felt... pointless. Like reading a kids’ book about emotions I’ve already processed years ago.\n\nIf they condensed the story down to 4–5 episodes, it might’ve worked better. But dragging one simple thought across an entire season just made it feel like a low-calorie meal dressed up as fine dining.\n\nYeah, it looks pretty. The animation is great. The music is nice. But all of that is surface-level. Underneath, there’s just not much there. Emotional depth isn’t about being quiet and melancholy — it’s about delivering something that moves you or makes you think. Frieren didn’t do either, at least not for me.\n\nNot every story needs to be action-packed, I totally get that. But if you’re gonna go slow, there better be something real waiting at the end.\nWith Frieren, I kept waiting — and it never came.",
      "score": 5,
      "tags": ["Not Recommended", "Funny"],
      "is_spoiler": false,
      "is_preliminary": false,
      "episodes_watched": null,
      "entry": {
        "mal_id": 52991,
        "url": "https://myanimelist.net/anime/52991/Sousou_no_Frieren",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1015/138006.jpg?s=3396013094c69095e19477370158330d",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1015/138006t.jpg?s=3396013094c69095e19477370158330d",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1015/138006l.jpg?s=3396013094c69095e19477370158330d"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1015/138006.webp?s=3396013094c69095e19477370158330d",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1015/138006t.webp?s=3396013094c69095e19477370158330d",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1015/138006l.webp?s=3396013094c69095e19477370158330d"
          }
        },
        "title": "Sousou no Frieren"
      },
      "user": {
        "url": "https://myanimelist.net/profile/NutBarber",
        "username": "NutBarber",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/s/common/userimages/b83cd0a4-3f73-4915-b9fe-bcc14852c3c4_225w?s=e5f32a207123a725fc9a5a1704c78bc9"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/s/common/userimages/b83cd0a4-3f73-4915-b9fe-bcc14852c3c4_225w?s=e5f32a207123a725fc9a5a1704c78bc9"
          }
        }
      }
    },
    {
      "mal_id": 557989,
      "url": "https://myanimelist.net/reviews.php?id=557989",
      "type": "anime",
      "reactions": {
        "overall": 2,
        "nice": 0,
        "love_it": 1,
        "funny": 0,
        "confusing": 1,
        "informative": 0,
        "well_written": 0,
        "creative": 0
      },
      "date": "2025-04-08T08:06:00+00:00",
      "review": "To be honest, I don't know why people hate solo leveling. You'll just review bomb anything that gets more attention than your favorite anime.  Anyway, solo leveling starts with Sun Jin Woo being the weakest hunter of all time, fighting in dungeons to make money and save his mother from deep slumber or whatever it's called, but then suddenly he gets stuck in a double dungeon and gets tested to become a \"player\" and has the ability to get stronger with every level he gets like in a video game (this is important to the story later on, and they also explain why the powers weregiven) \n\nThis anime is good and is filled with action + nice animation. The story was a bit mid, but I can see why people think that, and it's because it's very short. The manwha has 180 chapters, and the anime covers 3/4 chapters every episode, and they also cut a lot of stuff out.\n\nSo yeah, the pacing is not that great, but there's still hope since there's a sequel to solo leveling, and it's called solo leveling Ragnarök.\n\nOther than that, there's really nothing wrong with it, like every time I watch an anime I always fall asleep, but solo leveling kept me hooked and awake.\n\nThis anime doesn't compare to one piece or any big anime, but it's definitely getting up there. Maybe in 50 episodes lol\n\nConclusion: 8.5/10 or 9.0/10. 100% recommend watching this.",
      "score": 9,
      "tags": ["Recommended"],
      "is_spoiler": false,
      "is_preliminary": false,
      "episodes_watched": null,
      "entry": {
        "mal_id": 58567,
        "url": "https://myanimelist.net/anime/58567/Ore_dake_Level_Up_na_Ken_Season_2__Arise_from_the_Shadow",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1448/147351.jpg?s=b03cdc1d00fe7b897df8f229789e0866",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1448/147351t.jpg?s=b03cdc1d00fe7b897df8f229789e0866",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1448/147351l.jpg?s=b03cdc1d00fe7b897df8f229789e0866"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1448/147351.webp?s=b03cdc1d00fe7b897df8f229789e0866",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1448/147351t.webp?s=b03cdc1d00fe7b897df8f229789e0866",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1448/147351l.webp?s=b03cdc1d00fe7b897df8f229789e0866"
          }
        },
        "title": "Ore dake Level Up na Ken Season 2: Arise from the Shadow"
      },
      "user": {
        "url": "https://myanimelist.net/profile/Crmsxon",
        "username": "Crmsxon",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/images/kaomoji_mal_white.png"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/images/kaomoji_mal_white.png"
          }
        }
      }
    },
    {
      "mal_id": 557987,
      "url": "https://myanimelist.net/reviews.php?id=557987",
      "type": "anime",
      "reactions": {
        "overall": 0,
        "nice": 0,
        "love_it": 0,
        "funny": 0,
        "confusing": 0,
        "informative": 0,
        "well_written": 0,
        "creative": 0
      },
      "date": "2025-04-08T07:57:00+00:00",
      "review": "When I first stumbled upon the trailer for this anime - I'm Getting Married to the Girl I Hate in My Class, I was kind of hyped, not gonna lie. The premise looked like the perfect setup for some spicy tsundere romance, forced proximity, maybe even a bit of that \"enemies to lovers\" magic. And to be fair, I was totally down for that. I thought it might give off the same feelings I had when I first watched Tsuki ga Kirei or Nisekoi—turns out, it tried to be Nisekoi's cousin, but ended up feeling more like a weaker imitation. The show starts off strong withthe whole \"our grandparents arranged our marriage\" twist, and Akane being this feisty, sharp-tongued tsundere with soft layers underneath was honestly the hook for me. She was the reason I stayed. I loved how she tried to balance her pride with her emotions—felt pretty real to me, like she didn’t want to give in but deep down, she was opening up little by little. Those tiny smiles and quiet moments she had were genuinely sweet. She was carrying half the emotional weight of the series on her shoulders, no cap.\n\nBut then… Saito.\n\nMan, this dude had me pulling my hair out. You’ve got this guy who’s objectively smart, composed, kinda aloof (in a cool way?), but then comes to romance and emotional intelligence? My guy completely short-circuits. He’s living under the same roof as Akane, she’s cooking for him, they’re brushing shoulders almost every day, sharing vulnerable moments—and yet he acts like it’s all just part of the curriculum. Like bro, are you dense or just scared of commitment?\n\nAnd don’t even get me started on his dynamic with Himari and Shisei. I get it, they’re classmates and have their own stories, but at some point, it just felt like he was emotionally cheating, even if it wasn’t intentional. There’s this scene (you’ll know which one if you’ve watched it) where Himari leans in a bit too close, and instead of drawing the line, he just... freezes. Like, really? If I was engaged—even if reluctantly—I’d at least respect the boundaries of the person I’m sharing a roof and future with. This dude’s heart is everywhere but where it’s supposed to be.\n\nHonestly, what killed it for me was the glacial pacing. Twelve episodes in, and the needle barely moved. It’s like watching two people on a slow escalator… but the escalator’s broken. You don’t even get a clear sense of progress—no confirmation of who likes who, no resolution, not even a strong emotional climax. Just... cute moments sprinkled here and there, which, I’ll admit, were adorable enough to save this from a 4/10.\n\nAnd yeah, I’ll confess—I did enjoy those cute bits. Some of the domestic scenes were warm and fuzzy, like watching a half-baked romance play out in slow motion. It gave me a couple of \"aww\" moments, and I’m a sucker for those.\n\nSo… will I be watching Season 2? Eh. Only if the writers decide to give Saito a brain (or a heart), and actually let the story progress. If he stops tiptoeing around his own damn feelings and finally chooses Akane and proves it—not just by words, but actions too—I might just stick around.\n\nUntil then, this one sits at a 6/10 for me. Has potential, but right now? It's like a lukewarm cup of tea that you keep sipping, hoping it'll get better.",
      "score": 6,
      "tags": ["Mixed Feelings"],
      "is_spoiler": false,
      "is_preliminary": false,
      "episodes_watched": null,
      "entry": {
        "mal_id": 59135,
        "url": "https://myanimelist.net/anime/59135/Class_no_Daikirai_na_Joshi_to_Kekkon_suru_Koto_ni_Natta",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1775/147330.jpg?s=94636bdfc4d9ed225675a188b3517fc1",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1775/147330t.jpg?s=94636bdfc4d9ed225675a188b3517fc1",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1775/147330l.jpg?s=94636bdfc4d9ed225675a188b3517fc1"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1775/147330.webp?s=94636bdfc4d9ed225675a188b3517fc1",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1775/147330t.webp?s=94636bdfc4d9ed225675a188b3517fc1",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1775/147330l.webp?s=94636bdfc4d9ed225675a188b3517fc1"
          }
        },
        "title": "Class no Daikirai na Joshi to Kekkon suru Koto ni Natta."
      },
      "user": {
        "url": "https://myanimelist.net/profile/AnimeExplorer21",
        "username": "AnimeExplorer21",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/s/common/userimages/853b5ea1-4a7c-4dfd-9e08-867fd0d23ad9_42x62_i?s=66d3915e8d1afb84d99b9282f486d8e2"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/s/common/userimages/853b5ea1-4a7c-4dfd-9e08-867fd0d23ad9_42x62_i?s=66d3915e8d1afb84d99b9282f486d8e2"
          }
        }
      }
    },
    {
      "mal_id": 557986,
      "url": "https://myanimelist.net/reviews.php?id=557986",
      "type": "anime",
      "reactions": {
        "overall": 0,
        "nice": 0,
        "love_it": 0,
        "funny": 0,
        "confusing": 0,
        "informative": 0,
        "well_written": 0,
        "creative": 0
      },
      "date": "2025-04-08T07:54:00+00:00",
      "review": "Castle in the Sky is a breathtaking classic that perfectly captures the heart and imagination of what Studio Ghibli does best. And as my very first Studio Ghibli movie, it absolutely delivered on all the magic and wonder I had heard about. The story follows Sheeta and Pazu, two endearing protagonists whose chemistry and bravery anchor the film's emotional core. Their journey to uncover the secrets of the mythical floating city of Laputa is filled with thrilling airship chases, whimsical moments, and a deeper message about greed, power, and the beauty of nature. The animation—especially for its time—is stunning. The rich, hand-drawn visuals bring the world tolife with a timeless charm, from vast blue skies to the majestic ruins of Laputa itself. And the music? Joe Hisaishi’s score is nothing short of magical, enhancing every scene with sweeping melodies that gave me chills more than once.\n\nWhat stood out to me most was how the film blends childlike wonder with meaningful themes. It has this unique ability to be lighthearted and serious at the same time, making it feel emotionally rich without ever losing its sense of adventure.\n\nWhy a 9/10? While it comes incredibly close to perfection, I felt the pacing in the middle slowed down just a touch—but that’s a small nitpick in an otherwise phenomenal experience.\n\nAs a first-time Ghibli viewer, Castle in the Sky left me enchanted, inspired, and hungry for more. If this is the standard, I can’t wait to dive deeper into the studio’s legendary catalog.",
      "score": 9,
      "tags": ["Recommended"],
      "is_spoiler": false,
      "is_preliminary": false,
      "episodes_watched": null,
      "entry": {
        "mal_id": 513,
        "url": "https://myanimelist.net/anime/513/Tenkuu_no_Shiro_Laputa",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/images/anime/5/37799.jpg?s=0eddfe5dc8e48682f3c1c63c5ded77c6",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/5/37799t.jpg?s=0eddfe5dc8e48682f3c1c63c5ded77c6",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/5/37799l.jpg?s=0eddfe5dc8e48682f3c1c63c5ded77c6"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/images/anime/5/37799.webp?s=0eddfe5dc8e48682f3c1c63c5ded77c6",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/5/37799t.webp?s=0eddfe5dc8e48682f3c1c63c5ded77c6",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/5/37799l.webp?s=0eddfe5dc8e48682f3c1c63c5ded77c6"
          }
        },
        "title": "Tenkuu no Shiro Laputa"
      },
      "user": {
        "url": "https://myanimelist.net/profile/BerryBlitz",
        "username": "BerryBlitz",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/images/kaomoji_mal_white.png"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/images/kaomoji_mal_white.png"
          }
        }
      }
    },
    {
      "mal_id": 557985,
      "url": "https://myanimelist.net/reviews.php?id=557985",
      "type": "anime",
      "reactions": {
        "overall": 0,
        "nice": 0,
        "love_it": 0,
        "funny": 0,
        "confusing": 0,
        "informative": 0,
        "well_written": 0,
        "creative": 0
      },
      "date": "2025-04-08T07:52:00+00:00",
      "review": "I stumbled on this anime while looking for something with an \"OP MC\" just because I like to watch those to kill time. This was way more enjoyable than I thought it would be; they added some really cool effects to magic, and the fight scenes are very well made. As for the story, it's as generic as it can be. The MC is OP and doesn't want anyone to find out while he just likes to keep learning new magic and doing magic sh*t without actually being the center of things. It has some decent comedy, some funny moments, and it gives somewhat decent sidecharacters.\n\nWhat is kind of annoying is the fact that the MC is a 10-year-old femboy. They made him look like a little girl (and sometimes behave as one, even pose as one) while pretty much a harem of girls just wants to be with him. I'm surprised this doesn't have a harem tag, to be honest. There's also the fact that the MC pretty much overpowers everyone with physical strength as well, which, again, having a 10-year-old skinny femboy body is kind of weird and sometimes off-putting.\n\nDon't expect anything extra exciting, groundbreaking, or anything of the sort. Just a decent 12 episodes with some cool fights and magic effects.",
      "score": 6,
      "tags": ["Mixed Feelings"],
      "is_spoiler": false,
      "is_preliminary": false,
      "episodes_watched": null,
      "entry": {
        "mal_id": 53516,
        "url": "https://myanimelist.net/anime/53516/Tensei_shitara_Dainana_Ouji_Datta_node_Kimama_ni_Majutsu_wo_Kiwamemasu",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1580/141243.jpg?s=04b8bc979327990434c69533eeddeea3",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1580/141243t.jpg?s=04b8bc979327990434c69533eeddeea3",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1580/141243l.jpg?s=04b8bc979327990434c69533eeddeea3"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1580/141243.webp?s=04b8bc979327990434c69533eeddeea3",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1580/141243t.webp?s=04b8bc979327990434c69533eeddeea3",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1580/141243l.webp?s=04b8bc979327990434c69533eeddeea3"
          }
        },
        "title": "Tensei shitara Dainana Ouji Datta node, Kimama ni Majutsu wo Kiwamemasu"
      },
      "user": {
        "url": "https://myanimelist.net/profile/JayJTheJet",
        "username": "JayJTheJet",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/s/common/userimages/ffb5bea4-0c86-4ded-8c25-1f4ab1740215_225w?s=21103db4505b78ff9d5a5203dfbcc732"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/s/common/userimages/ffb5bea4-0c86-4ded-8c25-1f4ab1740215_225w?s=21103db4505b78ff9d5a5203dfbcc732"
          }
        }
      }
    },
    {
      "mal_id": 557982,
      "url": "https://myanimelist.net/reviews.php?id=557982",
      "type": "anime",
      "reactions": {
        "overall": 0,
        "nice": 0,
        "love_it": 0,
        "funny": 0,
        "confusing": 0,
        "informative": 0,
        "well_written": 0,
        "creative": 0
      },
      "date": "2025-04-08T07:18:00+00:00",
      "review": "A Sign of Affection (Yubisaki to Renren) was one of those anime I was seriously dying to see. Like seriously. I read the manga way before the anime even aired, and I was literally counting down the days like, “Finally! FINALLY it’s getting animated!” I was so hyped. Mad insane. This was supposed to be it for me. My comfort anime. My soft little safe space. My everything. But then… the anime dropped, and something just felt off. I wanted to fall in love all over again. I wanted my heart to flutter the same way it did when I read the manga. But insteadI was just sitting there like, “…wait. What is this?? Why does this feel so… empty?”\n\nThe story follows Yuki Itose, this sweet, gentle, super kind deaf college girl, who ends up meeting a well-traveled, charming senpai named Itsuomi on the train. He helps her out in this small but meaningful moment and they slowly start getting closer. On paper? Yeah it’s adorable. It’s soft. It’s everything a fluffy romance should be. So if you're just here for the cuteness, maybe it'll charm you. But for me someone who literally cherishes the manga this anime felt… hollow. Like the soul of this got lost in translation.\n\nFirst of all, in the manga. I felt Yuki’s inner world. Her loneliness, her struggles, the weight of not having anyone who really speaks her language, not even her own parents. Her loneliness wasn’t just a detail, it was this heavy, aching thing. Her notebook was like her entire voice. And her lifeline. So when Itsuomi came into the picture, it wasn’t just some “guy helps girl and she swoons” moment. It was deeper. He made her feel safe and secure. He made her feel seen and understood. He was warmth. Comfort. Home. And the manga nailed that emotional depth. You could feel it. You could breathe it. You could see how slowly and tenderly their love bloomed and how much they cared about each other. It felt so real and intimate. But the anime… lacked it. It flattened everything.\n\nYuki ended up feeling like just a cute shy girl who blushes every time a guy breathes near her. Her feelings for Itsuomi looked like they popped outta nowhere just 'cause he patted her head once? Like… hold on girl.. where’s the build-up?? Where’s the emotional weight?? In the manga, being near Itsuomi made her feel safe. Like she could finally exhale. That was her person. The one who saw her, not just the girl who couldn’t hear. He was someone who didn’t just see her as “the deaf girl,” but as Yuki. And for someone who’s lived her whole life in a world where no one speaks her language? That hits deep. He felt like her shelter. Her comfort zone. But the anime couldn’t grip that. It didn’t show it. It didn’t feel it. I was waiting for my heart to ache in the best way… but it just didn’t come.\n\nEven the general tone was off. The music didn’t carry the softness this story needs, and the voice acting felt emotionally bland. I imagined Yuki’s inner monologue sounding soft and dreamy, while Itsuomi’s voice being calm, kind, and lowkey flirty in a quiet way. But instead it felt so stiff and polished, like all the feelings got cleaned out in post-production or something. Even the cute, funny moments that made me giggle while reading? Just flopped on screen. They were awkward instead of wholesome. The magic was gone. The charm? Missing in action. That raw softness that made the manga feel like a warm hug, felt like I was watching a watered-down version that didn’t know how to carry its own emotional weight.\n\nWhat honestly made me the most frustrated though was how the anime portrayed Yuki being deaf. The anime missed a chance to show what her life really feels like. In the manga, her struggles were there. Her isolation, her exhaustion, her strength. It mattered. It shaped who she was and made the story feel so raw and real. In the manga, you could feel her isolation. Her frustration. How exhausting it is to exist in a world that doesn’t speak your language. But the anime? It made being deaf feel like some quirky character trait. Like a gimmick to make the romance feels different. And sometimes, it unintentionally validated the wrong message. It made her look helpless over the smallest things, like… no. Deaf people are strong, smart and resourceful. They adapt. They’re not fragile little flowers. That portrayal just didn’t sit right with me at all and I wish the anime showed more of that.\n\nHonestly, I hate that I feel this way. Because I love this story. I love these characters. But the anime version felt like a pretty shell with no heart inside. Like watching a love story from behind a glass wall. I couldn’t connect. I couldn’t feel. And I wanted to. I tried to. But it didn’t happen. Maybe this adaptation works better for people who haven’t read the manga. Maybe if you’re going in fresh, it still feels sweet and comforting. And if that’s you, genuinely, I’m happy for you. I hope it made your heart flutter. But for someone like me, who holds the manga so close to her chest… this anime just broke my heart in a very quiet, disappointing way.\n\nTL;DR: I adore the manga, but the anime adaptation of A Sign of Affection felt emotionally flat. The voice acting, music, and pacing didn’t live up to the depth and softness of the original. The emotional growth, the struggles of being deaf, the bond between Yuki and Itsuomi, all of it felt lighter and less impactful. I might be in the minority, but this adaptation didn’t capture the magic for me.\n\n(I really hope others can still find something beautiful in it though, even if I couldn’t.) (｡•́︿•̀｡)\n\nThanks for reading.",
      "score": 6,
      "tags": ["Mixed Feelings"],
      "is_spoiler": false,
      "is_preliminary": false,
      "episodes_watched": null,
      "entry": {
        "mal_id": 55866,
        "url": "https://myanimelist.net/anime/55866/Yubisaki_to_Renren",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1478/140828.jpg?s=99dc3986fce95119979e7824f5b30446",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1478/140828t.jpg?s=99dc3986fce95119979e7824f5b30446",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1478/140828l.jpg?s=99dc3986fce95119979e7824f5b30446"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1478/140828.webp?s=99dc3986fce95119979e7824f5b30446",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1478/140828t.webp?s=99dc3986fce95119979e7824f5b30446",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1478/140828l.webp?s=99dc3986fce95119979e7824f5b30446"
          }
        },
        "title": "Yubisaki to Renren"
      },
      "user": {
        "url": "https://myanimelist.net/profile/duskwoven",
        "username": "duskwoven",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/s/common/userimages/c204ae4c-62c7-4c9b-a1b5-769a968a57d2_42x62_i?s=7296adc7864580c76f6371258f65165c"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/s/common/userimages/c204ae4c-62c7-4c9b-a1b5-769a968a57d2_42x62_i?s=7296adc7864580c76f6371258f65165c"
          }
        }
      }
    },
    {
      "mal_id": 557979,
      "url": "https://myanimelist.net/reviews.php?id=557979",
      "type": "anime",
      "reactions": {
        "overall": 0,
        "nice": 0,
        "love_it": 0,
        "funny": 0,
        "confusing": 0,
        "informative": 0,
        "well_written": 0,
        "creative": 0
      },
      "date": "2025-04-08T05:38:00+00:00",
      "review": "This anime wasn’t exactly what I expected—but in the best way. I thought it would be a typical comedy mixed with some light power fantasy, nothing too exciting. Instead, it turned out to be fast-paced, over-the-top, and genuinely exciting, all without falling into typical power fantasy tropes. I binged the whole thing and now I can’t wait for the next season. In a lot of shows, things go wrong for the MC in ways that feel forced, or annoying side characters are used to create cheap drama or comedy. But here, none of the characters felt redundant or irritating—in fact, I liked most of them. If theanimation had just a few more frames and the anime had included more detail on how the “Wealth Conversion System”  works and its interactions with the MC (adding one episode to the season) I’d give it a solid 9/10.",
      "score": 8,
      "tags": ["Recommended"],
      "is_spoiler": false,
      "is_preliminary": false,
      "episodes_watched": null,
      "entry": {
        "mal_id": 57663,
        "url": "https://myanimelist.net/anime/57663/Kui_Cheng_Shoufu_Cong_Youxi_Kaishi",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1635/140669.jpg?s=888d067f0af663188cab2f5d2382cdd5",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1635/140669t.jpg?s=888d067f0af663188cab2f5d2382cdd5",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1635/140669l.jpg?s=888d067f0af663188cab2f5d2382cdd5"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1635/140669.webp?s=888d067f0af663188cab2f5d2382cdd5",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1635/140669t.webp?s=888d067f0af663188cab2f5d2382cdd5",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1635/140669l.webp?s=888d067f0af663188cab2f5d2382cdd5"
          }
        },
        "title": "Kui Cheng Shoufu Cong Youxi Kaishi"
      },
      "user": {
        "url": "https://myanimelist.net/profile/Sjama",
        "username": "Sjama",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/images/kaomoji_mal_white.png"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/images/kaomoji_mal_white.png"
          }
        }
      }
    },
    {
      "mal_id": 557977,
      "url": "https://myanimelist.net/reviews.php?id=557977",
      "type": "anime",
      "reactions": {
        "overall": 7,
        "nice": 4,
        "love_it": 0,
        "funny": 2,
        "confusing": 0,
        "informative": 1,
        "well_written": 0,
        "creative": 0
      },
      "date": "2025-04-08T05:01:00+00:00",
      "review": "Let’s get one thing straight: Episode 1 of Oshi no Ko is a banger. It had shock value, emotional weight, and a storyline that grabbed you by the throat. For 90 minutes, I thought I was about to witness something truly great. Then the rest of the season happened—and it was an absolute trainwreck. Everything after the premiere is a frustrating mess. The characters are hollow shells, written with all the depth of a kiddie pool. Aqua turns into a brooding edge-lord with zero charisma or consistency. Ruby’s entire existence in the plot feels like filler, and the side characters—Kana, Akane, the entire supporting cast—range from forgettableto downright annoying.\n\nThe story nosedives into a dull idol industry soap opera, packed with melodrama and cringe-inducing attempts at “dark” themes that end up feeling more like high school fanfiction. Whatever tension or intrigue Episode 1 created is completely thrown out the window in favor of half-baked love triangles, exposition dumps, and hollow social commentary.\n\nThe pacing is glacial, the tone is all over the place, and by the time the season wraps up, it feels like you just wasted hours watching a show that tricked you with a good pilot and then laughed in your face.\n\nOshi no Ko is the textbook definition of wasted potential. If the rest of the show had even half the quality of the first episode, this could’ve been something special. Instead, it’s just a pretty-looking dumpster fire.",
      "score": 2,
      "tags": ["Not Recommended"],
      "is_spoiler": false,
      "is_preliminary": false,
      "episodes_watched": null,
      "entry": {
        "mal_id": 52034,
        "url": "https://myanimelist.net/anime/52034/Oshi_no_Ko",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1812/134736.jpg?s=b95c91f6e67b2b0f46cc61f3c5e91ecb",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1812/134736t.jpg?s=b95c91f6e67b2b0f46cc61f3c5e91ecb",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1812/134736l.jpg?s=b95c91f6e67b2b0f46cc61f3c5e91ecb"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1812/134736.webp?s=b95c91f6e67b2b0f46cc61f3c5e91ecb",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1812/134736t.webp?s=b95c91f6e67b2b0f46cc61f3c5e91ecb",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1812/134736l.webp?s=b95c91f6e67b2b0f46cc61f3c5e91ecb"
          }
        },
        "title": "[Oshi no Ko]"
      },
      "user": {
        "url": "https://myanimelist.net/profile/KARIDO_SAN",
        "username": "KARIDO_SAN",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/images/kaomoji_mal_white.png"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/images/kaomoji_mal_white.png"
          }
        }
      }
    },
    {
      "mal_id": 557976,
      "url": "https://myanimelist.net/reviews.php?id=557976",
      "type": "anime",
      "reactions": {
        "overall": 4,
        "nice": 1,
        "love_it": 1,
        "funny": 1,
        "confusing": 1,
        "informative": 0,
        "well_written": 0,
        "creative": 0
      },
      "date": "2025-04-08T04:54:00+00:00",
      "review": "Recently watched this on Animyne, and I’m still in awe of just how incredible this season is. Building on the foundation of its groundbreaking first season, this 9/10 installment takes the action, storytelling, and spectacle to even greater heights. A-1 Pictures delivers animation that’s nothing short of stunning—every fight is a masterclass in fluid motion and dynamic cinematography. Sung Jin-Woo’s shadow soldiers bring an eerie, mesmerizing beauty to the battles, while the dungeons are crafted with such immersive detail that they feel like characters themselves. But what truly sets this season apart is its emotional weight. Jin-Woo’s transformation from a struggling survivor to a commanding force islayered with moral dilemmas and personal stakes. The bond between him and his shadow army raises thought-provoking questions about power, loyalty, and the cost of strength. A must-watch for any action anime fan!",
      "score": 9,
      "tags": ["Recommended"],
      "is_spoiler": false,
      "is_preliminary": false,
      "episodes_watched": null,
      "entry": {
        "mal_id": 58567,
        "url": "https://myanimelist.net/anime/58567/Ore_dake_Level_Up_na_Ken_Season_2__Arise_from_the_Shadow",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1448/147351.jpg?s=b03cdc1d00fe7b897df8f229789e0866",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1448/147351t.jpg?s=b03cdc1d00fe7b897df8f229789e0866",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1448/147351l.jpg?s=b03cdc1d00fe7b897df8f229789e0866"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/images/anime/1448/147351.webp?s=b03cdc1d00fe7b897df8f229789e0866",
            "small_image_url": "https://cdn.myanimelist.net/images/anime/1448/147351t.webp?s=b03cdc1d00fe7b897df8f229789e0866",
            "large_image_url": "https://cdn.myanimelist.net/images/anime/1448/147351l.webp?s=b03cdc1d00fe7b897df8f229789e0866"
          }
        },
        "title": "Ore dake Level Up na Ken Season 2: Arise from the Shadow"
      },
      "user": {
        "url": "https://myanimelist.net/profile/bigbodybenz",
        "username": "bigbodybenz",
        "images": {
          "jpg": {
            "image_url": "https://cdn.myanimelist.net/s/common/userimages/a9be9511-e1f0-4829-969e-e764b8af6b43_42x62_i?s=5124226568ca93b606aee351974d8056"
          },
          "webp": {
            "image_url": "https://cdn.myanimelist.net/s/common/userimages/a9be9511-e1f0-4829-969e-e764b8af6b43_42x62_i?s=5124226568ca93b606aee351974d8056"
          }
        }
      }
    }
  ]
}
